{
    "title": "TimeWarriors",
    "description": "In TimeWarriors, your mission is to lead an evolving army through the ages, starting from the Stone Age. Your ability to deploy troops is directly tied to your food supply. For every three pieces of food, you can send out one soldier. This means you’ll need to manage your rations: stockpiling food carefully is your priority. At the start of the game, resources are scarce, but watching ads can give you a helpful boost, allowing you to send out more soldiers and gain an early advantage.\nThe key to winning battles is timing and strategy. Deploy your troops when you have enough food, overwhelming your opponent before they can strengthen their defenses. Early levels allow you to outpace your enemies by cutting off their stronger units, such as soldiers on horseback, before they even have a chance to leave their base. This tactic works particularly well in Level 1, where the enemy wields essential clubs in the Stone Age.\nAn example of soldier deployment is based on food at level 1:\nAs you progress into Level 2, the game shifts into the Farm Age, where your foes are equipped with shovels and better weaponry. To keep up, you’ll need to use the rewards you’ve earned to upgrade your army. Invest in advanced tools and weapons that match the technology of the age, but balance this with maintaining a steady flow of soldiers to ensure you’re not overwhelmed. The longer battles progress, the more critical it becomes to upgrade your troops and your base to increase food production and withstand enemy attacks.\nSeveral upgrades can give you a significant edge in battle. A grindstone sharpens your soldiers’ weapons, allowing them to inflict more damage, while a war banner rallies your troops to fight harder as a unified force. You can also invest in faster food production to deploy soldiers at a quicker pace or increase your base health to hold out against enemy assaults.\nVictory in TimeWarriors depends on finding the perfect balance between attacking, defending, and resource management. With each successful battle, you’ll move closer to mastering the game’s historical ages. From the Stone Age(70,000–20,000 BC), where tools and settlements were in their infancy, to the Farm Age (12,000–4,000 BC), where agriculture and domestication laid the foundation for civilizations, every level challenges you to adapt and evolve. Lead your army wisely, and you’ll rewrite history with your conquests!",
    "cover_image": "https://imgs.crazygames.com/timewarriors_16x9/20250604030634/timewarriors_16x9-cover?metadata=none&quality=100&width=1200&height=630&fit=crop",
    "link": "https://www.crazygames.com/embed/timewarriors"
}