{
    "title": "Chess Free",
    "description": "Chess Free follows the classic rules of chess. The objective is to checkmate your opponent's king, meaning it is in a position to be captured and cannot escape.\nYou can play against the computer, compete online with real players, or share the same screen with a friend. With 18 difficulty levels ranging from Beginner to World Champion, you can play based on your level.\nDepending on your level, you can choose a \"handicap,\" so you have a bit of an advantage. You can also enable hints and interactive tips to help guide you throughout.\nThe rules are basic—players take turns moving their pieces. Pawns move forward but capture diagonally, knights move in an L-shape, and other pieces have unique movement patterns. Strategy is key in chess. Protect your pieces, control the center of the board, and anticipate your opponent's moves. The game ends when one player's king is checkmated, resulting in a win or if a draw occurs under certain conditions.\nIn chess, a draw is a result where neither player wins, and the game ends in a tie. This can happen for several reasons, such as stalemate (where a player has no legal moves but is not in check), repetition of the same position three times, 50 moves without a capture or pawn move, insufficient material to checkmate, or mutual agreement between the players.\nMade a mistake?\nNo problem—use the move cancel feature to undo and rethink your strategy. After each match, detailed analysis highlights errors and suggests better moves, while the option to replay specific moments helps reinforce learning.\nYou can save your rating and pick different time control modes like bullet, blitz, and rapid. Customize the board and pieces to your liking, review your move history, and even express yourself with playful cartoon emotions as you interact with your opponent.",
    "cover_image": "https://imgs.crazygames.com/chess-free_16x9/20241227034433/chess-free_16x9-cover?metadata=none&quality=100&width=1200&height=630&fit=crop",
    "link": "https://www.crazygames.com/embed/chess-free"
}