{
    "title": "Basketball Legends 2020",
    "description": "Play solo or with a friend\nYou can play with a friend in 2-player mode or solo in Basketball Legends 2020. The AI characters are challenging if you’re solo.\nUnique teams and abilities\nYou can play 1 vs. 1 or 2 vs. 2 matches with various cartoon basketball players. Choose a basketball team that represents your state or one that you support. Each team player has a unique ability.\nVarious game modes\nYou can play full tournaments, and if you’re looking for a quick game of B-ball, quick play mode has you covered. Train your skills in training and random matches!\nClassic basketball moves\nBasketball Legends stays true to the spirit of basketball with three-pointers, alley-oops, and epic slam dunks that score you impressive points. Dash around and do epic jump shots to keep your opponent on their toes.\nUnique features of Basketball Legends 2020\nIn this game, you’ll have the opportunity to perform sci-fi style slam dunks, aka supershots, when the charge on the top left is complete, but be aware that it is not available for each of the available players in the game.\nSomething that differentiates Basketball Legends from other titles of the same genre is that each character has specific abilities and, for example, the mega slam dunk won’t be available if you are playing with Steph Curry, who is notoriously a great shooter and a passer but not an acrobatic dunker.\nEach player in Basketball Legends can have one of these special abilities:\nSo you’ll need to experiment with all of them and find the special ability that blends better with your style of play.\nThere are 16 teams available, each mimicking the logo and name of some of the most popular NBA franchises, and 3 players to choose from within each team. The players also bear an unmistakable resemblance to some of the most famous NBA stars.",
    "cover_image": "https://imgs.crazygames.com/basketball-legends-2020_16x9/20231122050621/basketball-legends-2020_16x9-cover?metadata=none&quality=100&width=1200&height=630&fit=crop",
    "link": "https://www.crazygames.com/embed/basketball-legends-2020"
}