{
    "title": "Kick Soccer Hero",
    "description": "Kick Soccer Hero is all about scoring goals in the most unpredictable settings imaginable. Sure, you are aiming for the net, but between you and victory lies pure chaos. One round, you might be dodging pallbearers carrying a coffin, another, you will be threading the ball past a scar-faced dancer at a spooky Halloween party. Sometimes you are kicking from the roof of a moving truck on a bridge, other times you are on a rec court where a prison guard is chasing down an escaped inmate. Every match feels like a surprise set piece waiting to happen.\nYou get three balls per round to make your goal. If an obstacle is blocking the net, you can use a shot to knock it out of the way before going for the score. A guiding line helps you visualize your trajectory, but the path is rarely straightforward.\nClear each round to collect rewards:\nScore stylish or complex shots to earn bonus points and trigger reward rounds for even more coins.\nAim with your mouse or by flicking your finger, then launch the ball toward the goal with power or precision. Use clever curve mechanics to bend the ball around defenders, and time your shots to outsmart goalkeepers and avoid moving obstacles. When the net is blocked, hit obstacles directly to clear your path, then go for the score. Keep winning to unlock new heroes, balls, and increasingly wild levels.\nKick Soccer Hero delivers smooth flick controls, hilarious and unpredictable match scenarios, and plenty of opportunities for stylish, high-scoring goals. The variety of environments keeps each round fresh, while the league progression and rewards give you a reason to keep coming back. Whether you are a casual player looking for a quick laugh or a competitive gamer chasing leaderboard glory, every match is an unpredictable adventure worth playing.",
    "cover_image": "https://imgs.crazygames.com/kick-football-herosoccer-game_16x9/20250705025423/kick-football-herosoccer-game_16x9-cover?metadata=none&quality=100&width=1200&height=630&fit=crop",
    "link": "https://www.crazygames.com/embed/kick-football-herosoccer-game"
}