[
    {
        "name": "Action",
        "items": [
            {
                "title": "1941 Frozen Front",
                "rating": "8.8",
                "released": "June 2016",
                "description": "Help Russia or Germany to defeat the other in 1941 Frozen Front, a new turn-based war game. Combat the enemy with tanks and infantry. Good luck!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/1941-frozen-front/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "3D Sandbox: Battle of the Kingdoms",
                "rating": "8.7",
                "released": "April 2025",
                "description": "3D Sandbox: Battle of the Kingdoms is an action simulation game where you have complete control over the rise and fall of kingdoms! Build empires, unleash mighty armies, and wield the forces of nature to alter history. Will you guide civilizations to prosperity or watch them crumble in war? The choice is yours!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/3d-sandbox-battle-of-the-kingdoms/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Against Zombies",
                "rating": "8.4",
                "released": "October 2023",
                "description": "Against Zombies is an action-packed 3D shooter that thrusts you into a perilous journey through a world overrun by zombies. Battle hordes of the most fearsome undead while defending your last hope for escape - a getaway car. Face the apocalypse head-on in this thrilling game of survival.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/against-zombies/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Age Of Arms",
                "rating": "8.9",
                "released": "October 2024",
                "description": "Age of Arms is a strategic defense game where you battle through different eras. Set your weapons in the enemy’s path, defeat foes, and evolve into stronger warriors in each age. With every victory, upgrade your arsenal and keep advancing to become the ultimate warrior of history’s greatest battles.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/age-of-arms/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Age of Tanks Warriors: TD War",
                "rating": "8.8",
                "released": "April 2024",
                "description": "Age of Tanks Warriors: TD War is an action tower defense battle game where you fight your opponent throughout the ages, starting from the Stone Age, making your way all the way to modern marvels. Your main task is strategically dominating the battlefield to constantly upgrade your army and conquer enemies in an epic 1v1 battle. Lead your army to victory in this strategic game and show your earned skills to the modern world.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/age-of-tanks-warriors-td-war/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Age Of War",
                "rating": "9.4",
                "released": "March 2018",
                "description": "Age of War is an action base defense game where you fight a continuous war. Keep creating units to protect your base and destroy the enemy. When you earn enough XP, your civilization will evolve through the ages, offering new technologies to utilize in combat.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/age-of-war/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Air Battle Royale: Sky Blitz",
                "rating": "8.0",
                "released": "October 2023",
                "description": "Air Battle Royale: Sky Blitz is an airplane shooting game where you take command of a heavily armed fighter jet. With just a single finger, you'll effortlessly soar through the skies, hunting down rivals and locking onto targets for intense dogfights. Win battles, earn rewards, and amp up your aircraft's speed and firepower or unlock even mightier planes. So, gear up, pilot – ascend to the skies and reign supreme as the ultimate ace in this high-flying extravaganza!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/air-battle-royale-sky-blitz/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Air Strike",
                "rating": "8.9",
                "released": "August 2023",
                "description": "Air Strike is a strategic rocket warfare game where you need to destroy all your enemies. Navigate two challenging stages of gameplay. In Stage 1, take control of a powerful rocket and strategically target personal stockpiles and enemies. Stage 2 puts you in command of an elite squad, tasked with eliminating all opposition. Engage in intense battles with tanks, helicopters, and more. With realistic 3D graphics, experience lifelike battles and explosive combat. Your mission's success relies on your tactical prowess. Prepare for victory, commander!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/air-strike/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Fury Foot",
                "rating": "9.1",
                "released": "October 2024",
                "description": "Anger Foot 3D is an action-packed game where your foot becomes your ultimate weapon. Foot fights through challenging rooms to defeat enemies and unlock powerful weapons. You can customize your foot fighter for even more fast-paced combat and immerse yourself in a vibrant world with a high-energy soundtrack. Kick your way to victory in this adrenaline-fueled adventure!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/anger-foot-3d/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Ant Colony: New War",
                "rating": "8.8",
                "released": "January 2023",
                "description": "Ant Colony: New War is an action clicker idle game where you are tasked to grow an ant colony. What fun! Explore a vast array of territories and engage in fierce battles with rival colonies as you strive for total dominance. Gather valuable resources to strengthen your forces and challenge other players in intense PvP combat. Strategically build and expand your colony, assembling the ultimate ant army capable of conquering any opposition.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/ant-colony-new-war/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Archer Defense",
                "rating": "8.5",
                "released": "April 2023",
                "description": "Archer Defense is an action game where you play as an archer defending your position against waves of enemies. You start with a basic bow, but you can upgrade it over time and use different power-ups like bomb, multi-shot, and freeze arrows. You can also set up defenses like sentries and barbed wires to help you fend off the enemy waves. The game features daily rewards, loot boxes to obtain new and powerful bows, and multiple levels of increasing difficulty. Can you defend your position against the enemy onslaught and emerge victorious?",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/archer-defense/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Archer Master 3D: Castle Defense",
                "rating": "8.1",
                "released": "April 2019",
                "description": "Archer Master 3D: Castle Defence is a cool defensive game in which you are the last person standing to defend the castle! Most of the inhabitants have abandoned you, and the rest have never fought at all.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/archer-master-3d-castle-defense/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Archer Ragdoll Masters",
                "rating": "8.6",
                "released": "November 2023",
                "description": "Archer Ragdoll Masters is a stickman archery action game with ragdoll physics. Line up your arrow and shoot your enemies down one by one. Pick up power-ups and equip new items to your stick archer to own the enemy with greater precision and power.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/archer-ragdoll-masters/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Archer Shooter 3D",
                "rating": "8.3",
                "released": "April 2025",
                "description": "Archer Shooter 3D is a thrilling archery game where precision and strategy are key to survival! Take aim, shoot down enemies, and rescue civilians using a limited number of arrows. Every shot counts! Miss too often, and it’s game over. Master your aim, time your shots, and clear each level with skill and focus.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/archer-shooter-3d-bpu/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Archers Arena",
                "rating": "8.9",
                "released": "January 2025",
                "description": "Archers Arena is an exhilarating mix of action and skills that tests your precision, decision-making, and adaptability. It’s designed to provide a challenging and adrenaline-filled experience for players who thrive on competition and enjoy mastering their skills. This game promises a dynamic gameplay experience that blends skill progression, tactical combat, and exciting visuals, making it a must-play for fans of action games.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/archers-arena/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Assassin Hero",
                "rating": "9.1",
                "released": "September 2023",
                "description": "Assassin Hero is a roguelike action game that immerses you in the secretive world of the Assassin Brotherhood. Traverse perilous landscapes, from ancient Egypt to medieval cities, Valhalla's hills, and the feudal Orient. Confront classic foes like Templars, pirates, murderers, and mythical creatures. Brace for epic battles against formidable bosses as you relentlessly pursue legendary assassin status. Refine your hit-and-run skills, endure unrelenting enemy hordes, and etch your legacy in Valhalla.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/assassin-hero-infinity-blade/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Attack of the Dead",
                "rating": "9.1",
                "released": "August 2023",
                "description": "Attack of the Dead is an action game where you must kill the hordes of zombies who are coming to you. You'll face an unrelenting onslaught of the undead, hungry to feast on the last remaining survivors. Prepare for an endless battle and prove your survival skills in this gripping game! Become a true hero and the last pillar of humanity and fight against the horrifying zombie threat!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/attack-of-the-dead/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Auto Ninja",
                "rating": "8.6",
                "released": "April 2025",
                "description": "Auto Ninja is a platformer that challenges you to conquer 41 trap-filled chambers using quick reflexes and sharp thinking. You’ll leap over spikes, dodge deadly obstacles, and solve puzzles as you race to the top. Collect every coin, master each floor, and prove you’ve got the skill to survive the entire tower.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/auto-ninja/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Autogun Heroes",
                "rating": "8.7",
                "released": "October 2024",
                "description": "Autogun Heroes is an action arcade platformer game that throws you into the heart of an alien-infested battleground alongside a team of fearless heroes. Armed with overloaded weapons and the ability to stack endless upgrades, you’ll blast through relentless waves of enemies in a vivid, fast-paced world teeming with chaos. Every step forward demands sharp strategy, quick reflexes, and the right gear to overpower the alien onslaught. Whether you’re unleashing devastating firepower, unlocking new abilities, or leading your squad into battle, the fight to reclaim your home is as intense as it is exhilarating.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/autogun-heroes-izk/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "AutoRPG Arena",
                "rating": "8.9",
                "released": "February 2025",
                "description": "AutoRPG Arena is a turn-based auto-battler RPG where every choice influences the fight. Collect powerful items, upgrade your heroes, and strategize to dominate the battlefield. With each battle, you refine your tactics and strengthen your team, ensuring no two encounters are the same. Victory depends on how well you adapt and optimize your squad.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/autorpg-arena-fbu/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Ave Castle",
                "rating": "8.1",
                "released": "October 2023",
                "description": "Ave Castle is a defense game where you take on the role of defense commander and must protect your castle using your strategy. Plant and cut down trees to get money. Use the money to hire new fighters and upgrade your army using wood. Destroy the enemy's castle, use rage skills during the heat of battle, and gain victory! You can also create your own maps and share them through the editor. Play with a friend by using the advanced settings in the menu. The goal of the game is to destroy the enemy's castle.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/ave-castle/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Bad Egg",
                "rating": "9.0",
                "released": "August 2023",
                "description": "Bad Egg is an action game where you play as one little egg who needs to survive and kill the zombie chicken army! Collect the eggs and upgrade yourself to become stronger. Hold on until the chopper picks you up. Get to the chopper, or you're clucked. Try to reach the top of the leaderboard! This is a free-range frenzy of arcade action from the yolked-up eggheads behind Shell Shockers. t",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/bad-egg/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Bash Arena",
                "rating": "8.9",
                "released": "July 2023",
                "description": "Bash Arena is an explosive fusion of Reverse Bullet Hell and Top-down Action genres set in a thrilling power fantasy world. Forget about saving princesses and embrace the endless battles for power, gold, and glory! Engage in furious and dynamic action, face 20 nerve-wracking waves, encounter a variety of enemies, and unlock over 20 upgrades to suit your play style. With global progression, powerful allies, and stunning pixel graphics, it's time to destroy, survive, and prove yourself as the ultimate champion to the crowd and the hordes of darkness!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/bash-arena/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Battalion Commander",
                "rating": "9.0",
                "released": "June 2020",
                "description": "Battalion Commander is a top-down shooter game to complete different missions. Control your hero soldier while he builds an army with allies and picks up money and experience points. Use skills when you are about to die and in need of help. It's wartime!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/battalion-commander/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Battalion Commander 1917",
                "rating": "8.7",
                "released": "July 2022",
                "description": "Battalion Commander 1917 is an action shooting game with World War I theme. Cross over into enemy territory to find an enormous enemy machine and destroy it. Free the fellow soldiers that are captive on the enemy territory and let them join you in the mission. Collect gold to buy valuable upgrades including a heavy tank!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/battalion-commander-1917/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Battalion Commander 2",
                "rating": "9.1",
                "released": "December 2022",
                "description": "Battalion Commander 2 is an action shooting game where you must shoot your enemy and survive till the end of the stage to win the game. Complete all the missions and save your friends that are being captured by your enemy. Recruit them to help you in the battle. Good luck, soldier!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/battalion-commander-2/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Battle Arena Race to Win",
                "rating": "8.8",
                "released": "April 2024",
                "description": "Battle Arena Race to Win is a high-octane arena game where you join the Red or Blue team and engage in fierce car battles. Choose from a variety of cars, collect and upgrade them to dominate the arena. Balance speed, durability, and acceleration to outmaneuver opponents. Equip your car with strategic items, upgrade for success, and climb the leaderboard to lead your team to victory!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/battle-arena-race-to-win/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Battle for the Galaxy",
                "rating": "9.1",
                "released": "November 2016",
                "description": "Battle for the Galaxy is a cross-platform MMOstrategygame set in space. Taking inspiration from the most celebrated sci-fi RTS games, you must build and expand your base and military force powerful enough to attack enemies, loot resources, defend your base, and earn medals. With immersive 3D visuals and great music, it's an excellent choice for free browser-based gaming.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/battle-for-the-galaxy/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Battle Island",
                "rating": "9.3",
                "released": "August 2022",
                "description": "Battle Island is an action game where you play as a monster trainer who wants to be the master of the island by beating all the other trainers! Battle with wild monsters, challenge the other trainers, earn money frombattles, and use the money to build an army of powerful monsters!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/battle-island/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Battle Masters",
                "rating": "9.3",
                "released": "June 2020",
                "description": "Battle Masters is a fighting game that lets you duke it out with 3 other fighters in awesome one-on-one matches to the death! The game plays in a rock-paper-scissors format - each turn, both of you will choose a hand, and the winner gets a chance to select an action from a list of commands. The winner can choose to either attack, use a skill, use an item, or wait. You'll keep doing this until either one has lost all of their HP. Choose your fighter and may luck be on your side!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/battle-masters/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "BattleChonk",
                "rating": "8.8",
                "released": "May 2025",
                "description": "BattleChonk is a charming defense game where you guide adorable creatures in their fight against the mischievous Gloomps. You’ll boost your dice, unleash clever attacks, and guard your town with growing strength. As challenges increase, you unlock new Chonks and upgrades, keeping every chapter fresh, strategic, and full of delightful surprises.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/battlechonk-hig/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Battlecruisers",
                "rating": "8.8",
                "released": "April 2025",
                "description": "Battlecruisers is a high-intensity strategy game set in a robot-controlled world after humanity’s disappearance. Command a stolen Battlecruiser, build autonomous weapons, and outmaneuver powerful enemy fleets. Progress through a gripping story with 40 levels or test your tactical prowess in endless battles. Upgrade your arsenal, unlock devastating firepower, and master the art of robotic warfare!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/battlecruisers/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Battleship",
                "rating": "8.4",
                "released": "December 2019",
                "description": "Battleship is a classic two-player naval strategy game that you can play for free in your web browser. You are the commanding officer of an elite fleet of battleships at war with an equally capable enemy. Take turns to fire on your opponent's territory using an array of ranged weaponry.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/battleship/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Bear Haven",
                "rating": "8.4",
                "released": "July 2022",
                "description": "Bear Haven is a horror game where you need to survive the night from the scary bear. You are a new part-time electrician in Bear Haven Motel who get a night shift job. There's a lack of guests at this time and also there are some strange problems with the electrical system at night, make sure you'll manage to fix them all before 6 AM or you'll be fired. But beware of the bear! Hide and turn off the light if you see one of them. Don't let the bear get you!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/bear-haven/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Blocky Tank 3D",
                "rating": "8.5",
                "released": "February 2025",
                "description": "Blocky Tank 3D is an exciting 3D game where you command powerful blocky tanks to battle zombies, spiders, and mutant bosses. An evil wizard has turned villagers into zombies and unleashed an army of monsters to take over the world. Starting as a noob, you must fight through action-packed battles, upgrade your tank, and rise through the ranks to stop this dark force.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/blocky-tank-3d/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Bloons Tower Defense 3",
                "rating": "8.2",
                "released": "May 2021",
                "description": "Bloons Tower Defense 3 is a tower defense game where you can place monkeys, pineapple bombs, needles, etc., to pop the balloons. Unlock new tracks and choose between 3 difficulty modes to achieve that total bloon popping satisfaction.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/bloons-tower-defense-3/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Bloons Tower Defense 4 Expansion",
                "rating": "8.3",
                "released": "January 2014",
                "description": "Bloons Tower Defense 4 Expansion is a fun endless tower defense game. Strategically place your monkey towers along the path to pop all the balloons and defend your territory. With new maps, towers, and upgrades, test your skills and find the best strategies to stop the relentless balloon invasion. Unlock powerful special abilities and unleash devastating attacks to overcome the toughest waves. Can you conquer the expanded challenges and emerge as the ultimate bloons-popping champion?",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/bloons-tower-defense-4-expansion/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Bomber Friends",
                "rating": "8.7",
                "released": "May 2017",
                "description": "Taking inspiration from theclassic Bomberman games, Bomber Friends allows you to take control of your character and work through a series of levels using a combination of skill and logic. During each level, you must find a suitable path through the maze and blast apart the obstructing blocks using your bombs. Before you can reach the exit, you must find a key to unlock the final door, and defeat opponents who block your path.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/bomber-friends/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Bomber XXL",
                "rating": "8.5",
                "released": "October 2023",
                "description": "Bomber XXL is an arcade action game where you control your airplane in the sky and survive your enemy's attack. Become a fearless pilot in a world filled with planes and bombers. Soar through the skies, and aim to get a high score!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/bomber-xxl/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Bomboo: Endless Bombing Fun",
                "rating": "8.3",
                "released": "May 2025",
                "description": "Bomboo: Endless Bombing Fun is an explosive Bomberman-style adventure where quirky ghost heroes take on slimes in endlessly challenging levels. Strategically plant bombs, smash obstacles, and grab powerful upgrades like speed boosts and remote blasts. Unlock colorful characters and themes as you spin for coins and conquer the chaos in this fast-paced, ghostly blast fest.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/bomboo-endless-bombing-fun-kef/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Boom Slingers ReBoom",
                "rating": "9.2",
                "released": "July 2025",
                "description": "Boom Slingers ReBoom is a wild 1v1 multiplayer showdown filled with explosive weapons, quirky characters, and chaotic physics. Face off against real players worldwide in fast-paced turn-based battles using lasers, grenades, bats, and more. Unlock over 50 heroes, master bullet-time trick shots, and sling your way to victory in this action-packed, style-rich arena.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/boom-slingers-reboom/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Boom!",
                "rating": "8.8",
                "released": "July 2025",
                "description": "Boom! is a retro-inspired, turn-based blast fest where every duel is a test of wits and chaos. Unleash bizarre weapons like fart beans and teleport balls to outsmart rivals and reshape destructible arenas. Pick from over 250 quirky fighters, conquer 150+ battlefields, and climb the ranks solo or with friends in unpredictable, explosive showdowns.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/boom-vid/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "BoomCraft",
                "rating": "8.5",
                "released": "October 2022",
                "description": "BoomCraft is a 2-player TNT game where you defeat your friend and become the survivor. With 4 different maps fight against your friend and make tactics!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/boomcraft/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Bot Bumper",
                "rating": "8.5",
                "released": "April 2024",
                "description": "Bot Bumper is an arcade action game where you'll take on the role of a feisty minibot in a futuristic arena teeming with rival minibots. In this adrenaline-fueled arcade action game, your objective is clear: outmaneuver, outwit, and outlast your opponents by strategically pushing them out of the arena or annihilating them with calculated collisions. Are you ready to prove your dominance in the arena? Strap in, rev your engines, and get ready to bump your way to victory in Bot Bumper!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/bot-bumper/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Bounce Out",
                "rating": "9.0",
                "released": "October 2022",
                "description": "Bounce Out is a casual game where you play as a monster who must eat all the humans in the area. Play by dragging and aiming toward the enemies. Each enemy will give you lore force, and every single enemy will be more powerful the further you go. So be careful and choose whom to eat first.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/bounce-out/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Brawl Frenzy: Fight.io",
                "rating": "8.7",
                "released": "December 2022",
                "description": "Brawl Frenzy: Fight.io is a wrestling game where you must defeat all opponents in the arena. Use any tricks, even illegal moves like jumping at your opponent from the corner of the arena. Fight in the city, football field, sea, and even on a skyscraper. Watch the opponent fly away and be the last one standing!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/brawl-frenzy-fight-io/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Brawl Hero",
                "rating": "8.5",
                "released": "November 2023",
                "description": "Brawl Hero is an action game where you take charge of a heroic character to throw balls at enemies. Avoid enemies' attacks, defeat all of the enemies, and level up yourself! Venture to the town, where you can chop wood, excavate stones, or mine gems. Trade these materials with the Wandering Trader for powerups. Gather coins along your journey and exchange them for many thrilling upgrades.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/brawl-hero/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Bro Royale",
                "rating": "8.5",
                "released": "August 2024",
                "description": "Bro Royale is an action battle game that takes shooting to the next level, blending heart-pounding survivor action with fierce PvP showdowns. Get ready for electrifying arena battles where every move matters, and the chaos keeps you on your toes. Whether you’re going solo in the adrenaline-pumping \"1 vs All\" mode or teaming up for high-stakes \"2 vs 2\" brawls, this game delivers non-stop action. Unleash your bro force, master tactical gameplay, and lead your clan to glory in multiplayer shootouts and epic team fights. It's your mission to reclaim the arena from the grip of mayhem—courage is everything.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/bro-royale/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Broomcraft Mystic Evasion",
                "rating": "8.5",
                "released": "February 2024",
                "description": "Broomcraft Mystic Evasion is a horde survival action game where you fly on a magic broom and survive in battle against tons of enemies! Defeat enemies and collect experience points. Level up and become stronger. Learn new spells and develop the spells you have acquired to be able to defeat enemies faster. Face various types of enemies and bosses who try to stop you. Collect coins to unlock new magic brooms, and don't forget to upgrade them to make them faster and more agile. Combine different magical spells, each associated with its own element, and find your winning strategy! There are two game modes available: Level Mode, where you can practice, explore new enemies, and, most importantly, conquer bosses; and Endless Mode, for those who want to challenge themselves against wave after wave of monsters. Good luck in the battle!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/broomcraft-mystic-evasion/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Cannon Clash",
                "rating": "9.1",
                "released": "July 2025",
                "description": "Cannon Clash is an action-packed island battle where you command a mighty cannon against rival pirates and enemy ships. Fire with precision, upgrade your arsenal, and defend your base in explosive showdowns. Outsmart and outshoot opponents to dominate the seas—because in this clash, only the sharpest aim survives.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/cannon-clash-yoo/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Cannon Pirates Multiplayer",
                "rating": "8.7",
                "released": "July 2024",
                "description": "Cannon Pirates Multiplayer is a game where you, as a pirate, must reach the treasure island by jumping between platforms using your cannon. Shoot downwards to propel yourself, navigate between barrels and platforms, and avoid obstacles. Test your skills to find the hidden treasure!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/cannon-pirates-multiplayer/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Car Battle",
                "rating": "9.1",
                "released": "August 2025",
                "description": "Car Battle is a high-octane driving brawler where your war car is both weapon and shield. Take on enemies in single-player campaigns or face off in two-player duels, each clash spanning five intense stages. Upgrade your ride, sharpen your strategy, and unlock avatars to customize your fighter as you charge through escalating battles.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/car-battle/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Carnage Battle Arena",
                "rating": "9.1",
                "released": "March 2024",
                "description": "Carnage Battle Arena is a sports car game where speed is just the beginning. With an extensive destruction model, you'll wreak havoc on the streets, transforming the environment as you race. Choose from 82 awesome cars across multiple game modes, including Battle Arena and Survival. Blocky, retro-styled graphics and game-changing power-ups add to the excitement as you race through dozens of unique maps.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/carnage-battle-arena/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Cars vs Skibidi Toilet",
                "rating": "8.8",
                "released": "July 2023",
                "description": "Cars vs Skibidi Toilet is an action-packed game where you engage in a thrilling battle against a monstrous Skibidi Toilet. Drive powerful cars armed with guns and unleash havoc on these invading creatures. Protect the city from their terror as you upgrade your vehicles, acquire new weapons, and become an unstoppable force against the toilet invasion. Explore the expansive city, encounter various types of Skibidi toilets, and save the residents from this unusual threat. Get ready for a wild mix of racing and shooting in this unique action game!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/cars-vs-skibidi-toilet/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Castle Defender Saga",
                "rating": "9.2",
                "released": "October 2021",
                "description": "Castle Defender Saga is an endless castle defense game. Hold back hordes of determined enemies by placing defenses on your castle tower. Upgrade your units and level up to increase your health and firepower.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/castle-defender-saga/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Cat and Granny",
                "rating": "8.5",
                "released": "January 2025",
                "description": "Cat and Granny is a chaotic first-person action where you play as a clever orange cat determined to outsmart the new black cat that Granny brought home! Cause havoc by knocking over flower pots, scattering objects, and scratching up furniture—all while making Granny believe the black cat is to blame.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/cat-and-granny-original/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Chakram Master",
                "rating": "8.7",
                "released": "February 2025",
                "description": "Chakram Master is a casual action game where precision and strategy are key! Aim your chakram, throw it to slice through enemies, and teleport to its location with a second click or when it stops bouncing. Move, dodge, and plan your limited throws carefully to clear out enemies and master the art of the chakram. Can you become the ultimate Chakram Master?",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/chakram-master/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Clash of Ages",
                "rating": "8.5",
                "released": "September 2024",
                "description": "Clash of Ages is a strategic battle game where you lead your army from the Stone Age to the Modern Era. Begin with primitive tactics, conquer enemies, and earn coins to unlock advanced technologies. Progress through different eras, mastering new strategies and weapons to achieve ultimate victory in this epic clash.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/clash-of-ages/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Clash of Armor",
                "rating": "9.2",
                "released": "July 2019",
                "description": "Clash of Armor is an intense tank battle game. Deploy powerful tanks and destroy the enemy's turret to win the match.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/clash-of-armor/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Clash of Orcs",
                "rating": "9.2",
                "released": "September 2019",
                "description": "The orcs are having battles. Help your tribe survive by sending the best orc fighters to destroy the enemies!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/clash-of-orcs/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Clash of Skulls",
                "rating": "9.1",
                "released": "June 2022",
                "description": "Clash of Skulls is a tower defense game to prevent enemies from destroying your base by deploying various types of skulls army. Level up your army to increase your damage. Start planning your attacks to take over your enemy's territory. Hire skeleton warriors with blades, spears, scythes, explosives, battering rams, and much more!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/clash-of-skulls/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Clash of Tanks",
                "rating": "9.2",
                "released": "May 2019",
                "description": "Get ready for battle in this awesome RTS tank game. In Clash of Tanks, you become the army commander. You must deploy your tank carefully and think about where the enemy tanks are placed - don't get caught out or out-maneuvered.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/clash-of-tanks/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Clash of Vikings",
                "rating": "8.8",
                "released": "September 2022",
                "description": "Clash of Vikings is a strategic battle game where you summon Vikings to fight a single enemy. Place your units tactically using your elixir points and try to destroy the enemy’s towers before they bring you down.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/clash-of-vikings/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Cookie Delivery",
                "rating": "7.8",
                "released": "August 2021",
                "description": "Cookie Delivery is an action game about being a cookie deliveryman. This work is dangerous and difficult; in addition to obstacles on the road, you have to shoot back the animals who want to steal the cookies.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/cookie-delivery/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Cougar Simulator: Big Cats",
                "rating": "8.8",
                "released": "November 2024",
                "description": "Cougar Simulator: Big Cats is a simulation game that lets you step into the wild as a powerful cougar in a vast open-world adventure! Experience life as a big cat, hunting to feed yourself and your growing family, exploring beautiful landscapes, and upgrading your skills along the way. Customize your cougar’s appearance, choosing from different skins and even adding unique features like a magical glow or leopard-like spots.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/cougar-simulator-big-cats/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Craft and Battle",
                "rating": "8.7",
                "released": "February 2025",
                "description": "Craft and Battle is a strategic battle game where you command an army, build a base, and gather resources to outmaneuver your enemies. Recruit specialized units, exchange prisoners for valuable assets, and capture the enemy general to weaken their forces. Every battle tests your tactics as you fight across diverse maps against an unpredictable enemy army.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/craft-and-battle/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Crazy Miners",
                "rating": "9.1",
                "released": "February 2025",
                "description": "Crazy Miners is a fast-paced digging battle where you race to find the diamond hidden deep in the map! Dig through the terrain, avoid traps, collect diamond fragments to unlock new skins and power-ups, throw TNT to clear your path (or sabotage others), and be the first to claim victory!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/crazy-miners-multiplayer/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Crazy Vikings Life",
                "rating": "9.3",
                "released": "May 2025",
                "description": "Crazy Vikings Life is a wild cartoon-style strategy adventure where you command a fearless Viking clan on a quest for glory. Raid islands for loot, upgrade your scrappy raft into a mighty warship, and grow your base into a thriving Viking stronghold. Recruit warriors, train them for battle, and conquer the seas with humor and chaos.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/crazy-vikings-life/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Crown & Cannon",
                "rating": "8.7",
                "released": "September 2025",
                "description": "Crown & Cannon is a fast-paced 2D strategy game that challenges you to expand territory, command powerful weapons, and face off against dynamic AI on fully destructible terrain. With upgradeable units and tactical combat at its core, every battle demands sharp planning and bold moves as you carve your path to victory across shifting battlefields.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/crown-cannon/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Cube Commander",
                "rating": "9.2",
                "released": "May 2023",
                "description": "Cube Commander is an action game where you must battle against zombies and protect the innocent. Venture through various terrains, from forests to swamps, and even ice and hellfire, pushing your limits to the edge of the world. Rally brave soldiers and unleash their skills to fight off hordes of evil spirits. Upgrade your warriors across five levels, utilize the dynamite catapult for explosive destruction, ride dragons to rain down bombs, and mount animals for swift movement. Gather gold in chests to prepare for the next level. Can you triumph over the forces of darkness?",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/cube-commander/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Cursed Treasure 1.5",
                "rating": "8.9",
                "released": "August 2022",
                "description": "Cursed Treasure 1.5 is atower defense gamewhere you protect a stash of cursed jewels for an evil overlord. Stop the heroes from getting in and taking the corrupt gems by building defense towers and using magic.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/cursed-treasure-11-2/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Cursed Treasure 2",
                "rating": "8.8",
                "released": "November 2019",
                "description": "Cursed Treasure 2 is an action game, the long-awaited sequel toCursed Treasure, featuring improved gameplay and more levels! Defend your gems against enemies, champions, and bosses by building your towers strategically.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/cursed-treasure-2/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Cursed Treasure Level Pack",
                "rating": "8.7",
                "released": "September 2019",
                "description": "Level pack edition of the multi-races tower defense,Cursed Treasure. Protect your precious gems from being stolen.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/cursed-treasure-level-pack/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "CyberDino 3D",
                "rating": "9.0",
                "released": "January 2025",
                "description": "CyberDino 3D is an action-packed game where you control a futuristic cyber dinosaur in epic battles. Face off against waves of robots and monsters, enhance your equipment, and evolve your skills to dominate the battlefield. Embrace the challenge and prove you have what it takes to become the ultimate CyberDino champion.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/cyberdino-3d-nez/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "CyberDino: T-Rex vs Robots",
                "rating": "9.5",
                "released": "September 2021",
                "description": "CyberDino: T-Rex vs Robots is a side-scrolling action game featuring futuristic cyber dinosaur battles. Fight against various monsters and robots, upgrade your gear, and become the ultimate CyberDino.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/cyberdino-t-rex-vs-robots/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "CyberShark",
                "rating": "9.3",
                "released": "February 2023",
                "description": "CyberShark is anaction gamewhere you fight underwater enemies and play as a shark. Upgrade your armor, create new weapons to become stronger, open loot boxes to get items, and play the sea battle mini-game to get more coins. Be prepared and beat all the enemies!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/cybershark/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Daddy Rabbit",
                "rating": "9.1",
                "released": "October 2021",
                "description": "Daddy Rabbit is an action game where you control a daddy rabbit that must find and lead his scattered baby bunnies in underground mazes full of zombies.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/daddy-rabbit/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Dark Lands",
                "rating": "8.6",
                "released": "July 2021",
                "description": "Dark Lands is a side-scrolling battle runner action game. Enter the Dark Lands and test your survival skills. Buy magnets, crystals, and immortality bonuses to defeat orcs and avoid death. You can spend gems on improved helmets, armor, boots, and gloves. Good luck!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/dark-lands/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Dead Seek",
                "rating": "8.3",
                "released": "June 2025",
                "description": "Dead Seek is a high-octane action shooter where every bullet counts against swarming undead. Arm yourself with powerful weapons, upgrade your gear, and adapt your tactics as you push through infected danger zones. With intense visuals and non-stop combat, this arcade thrill ride keeps your trigger finger—and your survival instincts—on edge.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/dead-seek/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Defend Your Castle",
                "rating": "8.2",
                "released": "October 2017",
                "description": "Defend your castle is a brilliant stickman defense game brought to you by XGenStudios who are also responsible for Stick Arena Dimensions. You own a castle and must defend it from attacking soldiers – you must pick up a soldier and drop them from the sky or throw them through the air to kill them. You must move quickly, click carefully and keep throwing your enemies away!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/defend-your-castle/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Defend Your Nuts",
                "rating": "9.2",
                "released": "May 2022",
                "description": "Defend Your Nuts is a defense game where you take on the role of a brave squirrel defending its precious acorns from hordes of evil monsters. Your goal is to protect your stash by strategically using various weapons and items at your disposal.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/defend-your-nuts/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Desktop Tower Defense",
                "rating": "9.0",
                "released": "January 2014",
                "description": "Desktop Tower Defense is a classic tower defense game originally released in 2007 as a Flash game. It is made by Paul Preece and has been played 100s of millions of times. It's available here in HTML5 so that you can easily play it in your modern web browser.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/desktop-tower-defense/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Dice Wars",
                "rating": "8.5",
                "released": "",
                "description": "Dice Wars is an awesome game of conquest in which you must try to take over the world using dice. This game relies heavily on luck and the roll of the dice has to be on your side but you can also use your strategic mind to put the odds in your favor. You must try and conquer one territory at a time – you can attempt to conquer a territory by rolling the dice – if your roll is higher than your opponents roll your conquest is successful!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/dice-wars/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Dino Merge Wars",
                "rating": "9.0",
                "released": "February 2023",
                "description": "Dino Merge Wars is an action arcade game where you'll use a variety of powerful dinosaurs and humanoid characters on the battlefield to defeat fearsome dinos and emerge victorious. With a large selection of unique units, you'll have to set a strategize and decide which ones to send into battle. You can even merge your units to create even more powerful characters! You'll also be able to create your own dino riders, combining a dinosaur and a humanoid character. Thus, you'll be able to unleash devastating attacks and turn the tide of battle in your favor. Protect your Dino Egg and make sure it remains solid till your next battle! So what are you waiting for? Play Dino Merge Wars today and join the fight for survival!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/dino-merge-wars/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Dino World: Merge & Fight",
                "rating": "9.2",
                "released": "October 2023",
                "description": "Dino World: Merge & Fight is a dinosaur battle game where you need to merge items and equip them to your dinosaur so it becomes more powerful. Battle in dino-on-dino showdowns and emerge victorious against your opponents!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/dino-world-merge-fight/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Donut vs Donut",
                "rating": "8.9",
                "released": "August 2015",
                "description": "Donut vs Donut is a fast paced local multiplayer game featuring explosive donuts. It can be played with up to 4 players and the goal is to survive as the last donut in the ring. The game is made by Antti Salama, and if you like it you should consider buying the iOS version (see the button below). Good luck!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/donut-vs-donut/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Doomr.io",
                "rating": "8.5",
                "released": "August 2024",
                "description": "Doomr.io is a 3D post-apocalyptic shooter where survival is a relentless battle. After a devastating nuclear war, few human survivors remain. Mutants roam the desolate world, posing constant threats. Armed with powerful weapons and gear, you must fight through hordes of mutants in a constant struggle for survival. Only the strongest and most resourceful will endure in this unforgiving wasteland. You can hang out in safe zones to gear up, trade, and rest. Head to Survival Mode for PVE and to earn gear and items.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/doomr-io/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Dr. Psycho: Hospital Escape",
                "rating": "8.4",
                "released": "June 2023",
                "description": "Dr. Psycho: Hospital Escape is a thrilling horror escape game where you are trapped in a nightmare clinic and need to get out of there. Gather essential items to unlock doors and escape the clutches of the deranged Doctor Psycho and his psychotic patients. Time is ticking, you only have 3 days to break free. Navigate terrifying space and uncover multiple escape routes while avoiding detection. Hide in cleverly hidden places and explore the place carefully avoiding deadly traps. Can you outwit the doctor and secure your asylum escape?",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/dr-psycho-hospital-escape/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Dragon Simulator 3D",
                "rating": "9.1",
                "released": "November 2019",
                "description": "Dragon Simulator 3D is an action 3D animal simulator game in the same series asTiger SimulatorandRacoon Simulator. In this game, you are controlling a mighty dragon. Perform tasks and show your might to humans!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/dragon-simulator-3d/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Dragons Merge: Battle Games",
                "rating": "9.3",
                "released": "June 2025",
                "description": "Dragons Merge: Battle Games is an action-packed strategy adventure where you fuse dragons and warriors to forge an unstoppable army. Combine identical units to unlock powerful transformations, then lead your team into real-time battles bursting with fiery clashes and tactical decisions. Every merge strengthens your path to becoming the ultimate Dragon Master in a world brimming with challenges.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/dragons-merge-battle-games/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Drone.io - AI Survivor",
                "rating": "8.9",
                "released": "May 2025",
                "description": "Drone.io – AI Survivor is a survival game where you command a powerful drone squad in a war against HackGPT’s AI uprising. Build your fleet, adapt fast, and crush relentless robotic threats in real-time tactical combat. You’ll need sharp reflexes, bold strategy, and relentless firepower to stop the apocalypse.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/drone-io---ai-survivor/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Duck Life: Battle (Demo)",
                "rating": "9.2",
                "released": "September 2018",
                "description": "The ducks that we know so well from the previous Duck Life games are back, but this time they're angrier. Forget racing, now it's time to battle! Prepare your ducks for battle by training them. Once you are ready, head to the battlefield and start fighting other ducks. Don't forget to buy equipment to help you.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/duck-life-battle/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Duck Life: Space",
                "rating": "9.0",
                "released": "September 2017",
                "description": "Duck Life: Space is a duckracing gamewith a galactic story and theme. An alien from outer space has nabbed your trophy, and you need to go on a quest through space to get it back! Enjoy a plethora of new mini-games and races along the way.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/duck-life-space/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Duck Life",
                "rating": "9.3",
                "released": "",
                "description": "Duck Life is the first game in the Duck Life series. A tornado has struck your farm and destroyed everything. All that remains is a single duck egg. Train this duckling to peak athletic form so you can earn money to rebuild the farm.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/ducklife/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Duck Life 2",
                "rating": "9.1",
                "released": "",
                "description": "Duck Life 2 is a duck racing game with various training levels to improve your athletic abilities. When you’ve trained enough, you enter a duck ‘quadrathlon’’ that puts your running, climbing, swimming, and flying skills to the test. Just another day in the life of a duck!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/ducklife-2/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Duck Life 3",
                "rating": "9.1",
                "released": "",
                "description": "Duck Life 3 is a duck racing game featuring genetically modified ducks that evolve as you progress. Choose from one of four duck breeds and evolve as you complete each league. Like the previous game, training is essential to level up and improve your abilities.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/ducklife-3/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Duck Life 4",
                "rating": "8.5",
                "released": "October 2017",
                "description": "Duck Life 4 is a duck racing game set after the ban ongenetically modified ducks. A year has passed since the ban on genetically modified ducks and now it’s up to you to defeat the world champion. Train your duck team to compete in six new locations around the world.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/ducklife-4/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Dwarves: Glory, Death, and Loot",
                "rating": "9.4",
                "released": "December 2022",
                "description": "Dwarves: Glory, Death, and Loot is an action game where you lead an army of dwarves to victory through various battles. In this auto-battle RPG, you can decimate orcs, fight trolls, and battle dragons. You’ll discover glory, death, and humongous scores of loot!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/dwarves-glory-death-and-loot/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Eagle Ride",
                "rating": "9.0",
                "released": "October 2019",
                "description": "Eagle Ride is a very challenging flying game in which you ride on a fast-flying eagle and need to avoid the trees. Thankfully it is a bright day with only a little bit of fog, so you can see very clearly. The eagle's flying speed is very high and you need to swiftly avoid the trees. If you hit one, you can always restart and try again. What is the longest time you can fly without crashing? Good luck!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/eagle-ride/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Emerald and Amber",
                "rating": "9.3",
                "released": "April 2022",
                "description": "Help Emerald to get to Amber. Get stuck to the platforms to reach the goal!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/emerald-and-amber/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Endless Siege",
                "rating": "8.7",
                "released": "March 2021",
                "description": "Endless Siege is a tower defense game where you survive endless waves of enemies. Add various defense towers in tactical locations to defeat the sieging enemies. Level the towers up and upgrade them to more powerful units. See how many waves you can survive before being overrun by a horde of warring beasts! This game is inspired by Anuto TD.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/endless-siege/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Endless Waves Survival",
                "rating": "9.4",
                "released": "May 2023",
                "description": "Endless Waves Survival is an adrenaline-fueled endless survival game. Fight a continuous onslaught of enemies and claim upgrades and new abilities as you level up. How long will you survive the next run?",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/endless-waves-survival/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Endurance: A Top-Down Sci-Fi Shooter",
                "rating": "9.3",
                "released": "September 2023",
                "description": "Endurance: A Top-Down Sci-Fi Shooter is a thrilling pixel game set on a mysterious starship. As a researcher on the ship Endurance, you must survive the zombie-like crew, unravel the eerie story, and rescue sane members to build your team. Packed with humor, horror, and nods to classic sci-fi films, this action-packed adventure awaits.\"",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/endurance-a-top-down-sci-fi-shooter/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Epic Empire: Tower Defense",
                "rating": "8.6",
                "released": "August 2024",
                "description": "Epic Empire: Tower Defense is a thrilling strategy game where you command powerful heroes and towers to protect your kingdom from waves of evil forces. Embark on an epic adventure through vibrant worlds, from frozen kingdom, soaring magical kingdoms, dark underground tunnels, and enchanted florists. Face unique challenges worldwide as you battle to reclaim territories overrun by enemies.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/epic-empire-tower-defense/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Epic Sword Battle! Fight in Arena",
                "rating": "9.0",
                "released": "June 2025",
                "description": "Epic Sword Battle! Fight in Arena is a 3D action sword-fighting game where you're going to clash in chaotic arenas filled with action and ragdoll physics. Swing your blade and become the ultimate sword master. Use your reaction and accuracy to win every fight! The faster and more accurate your strikes, the higher your chances of becoming an arena champion!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/epic-sword-battle-fight-in-arena/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Escape From Prison Multiplayer",
                "rating": "8.8",
                "released": "July 2024",
                "description": "Escape From Prison Multiplayer is a thrilling multiplayer platformer game where your mission is to make a daring escape from prison! Customize your brave little mouse and race against time to break out. Each room you conquer brings you closer to freedom, but watch out for the dangerous traps and obstacles in your way! Can you outsmart the prison's challenges and make a successful escape? Test your skills and find out if you have what it takes to flee from prison!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/escape-from-prison-multiplayer/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Escape from Zombies",
                "rating": "9.0",
                "released": "May 2023",
                "description": "Escape From Zombies is a thrilling zombie action game where your mission is to save as many people as possible. Navigate through exciting levels, armed with a variety of weapons and simple controls. In this transformed world, overrun by zombies, it's up to you to guide survivors to the airfield for their safety. Exercise caution with missiles and exploding barrels to prevent harm to the people you're rescuing. The fate of humanity rests in your hands!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/escape-from-zombies/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Fantasy Madness",
                "rating": "9.3",
                "released": "October 2022",
                "description": "Fantasy Madness is a roguelike action-survival game set in a wildpunk World of Fantasy. Your goal is to stand against evil forces who want to destroy the natural order. Use a wide arsenal of arcane powers granted by beloved Mother Nature to smash down orcs from the Clan of Aluminum Helmets and other cunning foes.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/fantasy-madness/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Far Orion: New Worlds",
                "rating": "8.7",
                "released": "August 2023",
                "description": "Far Orion: New Worlds is an action game where you can command a team of brave heroes and lead your world to victory! The year is 2121, and technology has advanced far beyond the bounds of our wildest fantasies, but great progress also demands a great sacrifice. Use your strategy to set up your heroes and power card, beat all your opponents, and explore other worlds in search of treasure and limitless power!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/far-orion-new-worlds/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Fight Arena Online",
                "rating": "8.9",
                "released": "January 2021",
                "description": "Fight Arena Online is a 3D multiplayer brawling game that allows you to combine punches and kicks to beat other opponents.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/fight-arena-online/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Fish Frenzy",
                "rating": "8.7",
                "released": "May 2025",
                "description": "Fish Frenzy is a charming adventure where you guide a tiny fish on a journey to grow stronger and faster. You must skillfully snack on smaller fish while cleverly dodging the predators lurking nearby. Upgrade your abilities and sharpen your instincts as you glide through colorful waters, facing new challenges with every swift movement.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/fish-frenzy/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Flip Bottle",
                "rating": "8.5",
                "released": "October 2019",
                "description": "Flip Bottle is a simple but challenging one-button game. Flip the bottle and make it jump from object to object to reach the final platform.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/flip-bottle/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Fortress of the Wizard",
                "rating": "9.1",
                "released": "August 2025",
                "description": "Fortress of the Wizard is a magical defense adventure where you become a mighty sorcerer guarding your stronghold from relentless demon hordes. Harness an arsenal of devastating spells—fireballs, icy waves, swirling tornadoes, meteors, and more—to crush the invasion. Every battle tests your timing, strategy, and mastery of the arcane arts as you fight to protect your realm.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/fortress-of-the-wizard-mfx/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Fortzone Battle Royale",
                "rating": "8.9",
                "released": "May 2025",
                "description": "Fortzone Battle Royale is a high-stakes survival shooter where you face off against rivals in a massive, scenic battleground. Explore forests, cross rivers, and scavenge for resources as the action ramps up quickly. Outsmart enemies, collect powerful bonuses, and fight to be the last one standing in this fast-paced test of skill and strategy.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/fortzone-battle-royale-xkd/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "FPV War Kamikaze Drone",
                "rating": "8.4",
                "released": "July 2025",
                "description": "FPV War: Kamikaze Drone is a high-tech combat simulator that puts you in control of modern FPV drones across intense tactical missions. Experience the action through a realistic first-person view, enhanced by explosive visuals and immersive ragdoll physics, placing you right at the heart of the battlefield. Control combat FPV drones to destroy enemy vehicles and infantry using a mix of strategic planning, precision piloting, and a variety of powerful weapons. Every map challenges you to maximize your efficiency and secure victory.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/fpv-war-kamikaze-drone/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Frontline Defense",
                "rating": "8.3",
                "released": "May 2022",
                "description": "Frontline Defense is a tower defense game where you must strategically position towers along the enemy's path to defend your territory. As with other tower defense games, your objective is to build and strategically position towers to annihilate waves of incoming enemies. By employing effective tower placement and utilizing unique abilities you can successfully defend your territory and emerge victorious. Prepare for an exciting challenge as you navigate through various levels and devise strategies to defeat your adversaries!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/frontline-defense/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Rage Fruits Tower Defense",
                "rating": "9.0",
                "released": "January 2025",
                "description": "Rage Fruits Tower Defense is an innovative and humorous tower defense game with a unique blend of mechanics and quirky visuals. Combines backpack synthesis, roguelike elements, and tower defense, creating an engaging and fresh gameplay experience.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/fruit-tower-defense/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Funny Battle Simulator",
                "rating": "9.2",
                "released": "November 2022",
                "description": "Funny Battle Simulator is an action game where you must use your strategy to set up your army. Take command over infantry and archers. Send Cyclops and Spartans into battle. Watch your grenadiers throw grenades at enemies. Control the great Zeus and throw lightning. Crush all enemies. Show your tactical skills.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/funny-battle-simulator/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Funny Battle Simulator 2",
                "rating": "9.3",
                "released": "March 2022",
                "description": "Funny Battle Simulator 2 is a battle simulation game where you tactically place an army and take them into battle. Add a variety of units to fight for your side, from cavemen to bears with miniguns.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/funny-battle-simulator-2/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Funny Blade & Magic",
                "rating": "9.1",
                "released": "March 2023",
                "description": "Funny Blade & Magic is an action game where you step into a goofy world seeking to reclaim the throne of the goblin king after your uncle betrayed you. Use magical abilities and powerful weapons like swords, axes, and hammers to fight close-quarters with unique bosses and enemies. Are you ready to become the funniest and strongest goblin?",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/funny-blade-magic/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Furry Road",
                "rating": "9.2",
                "released": "July 2025",
                "description": "Furry Road is a fierce combat racing game where your car becomes a weapon in a post-apocalyptic showdown. Build a deadly war cart, equip rocket launchers, and blast through enemies, mutant creatures, and brutal bosses. Outspeed rivals, upgrade your ride, and prove you have the reflexes and grit to survive this relentless road war.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/furry-road-veb/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Fury Wars - Online Shooter",
                "rating": "8.9",
                "released": "July 2025",
                "description": "Fury Wars - Online Shooter is a wild third-person online shooter where chaos, absurd humor, and explosive action collide. Unleash a ridiculous arsenal—from flaming tridents to explosive fish—while battling as hilariously twisted hero parodies. Dive into Escort Mode, unleash ultimate abilities, and turn every match into a frantic, cartoon-style showdown packed with trashy, unpredictable fun.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/fury-wars---online-shooter/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Galaxy Control: 3D Strategy",
                "rating": "8.8",
                "released": "April 2025",
                "description": "Galaxy Control: 3D Strategy is a 3D space strategy game that puts you in command of epic battles and interstellar expansion. Build your base, defend your territory, and engage in thrilling conflicts with other players. With its stunning visuals and dynamic gameplay, every decision you make shapes the galaxy's future. Test your strategic skills and conquer the stars!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/galaxy-control-3d-strategy/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Gangsters",
                "rating": "8.7",
                "released": "December 2018",
                "description": "Gangsters is a pixelated shooting mayhem in which the players takes control of a gang. The goal of the game is to defend your turf against rival gangs. The graphics are retro and pixelated but the gameplay is exciting, intense and bloody. You can use a different weapons such as pistols and machine guns to fight the rival gangs.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/gangsters/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Geometry: Open World",
                "rating": "8.1",
                "released": "October 2024",
                "description": "Geometry: Open World is a fast-paced 2D action game where players control a ship navigating through treacherous obstacles, battling a variety of enemies, and ultimately facing off against formidable bosses. The game’s dynamic and vibrant open world, combined with strategic upgrades and powerful abilities, allows you to chart your course to victory! Can you defeat the bosses, conquer the obstacles, and become the best player in this open-world geometry action game?",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/geometry-dash-open-world/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Getaway Shootout",
                "rating": "8.7",
                "released": "April 2022",
                "description": "Getaway Shooter is a chaotictwo-player gamewhere you race three others to the finish line. Your moves are limited, and you can only move by jumping left or right, making the race tricky! Pick up guns and other weapons along the way to use against the others. May the best player win!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/getaway-shootout/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Ghetto Fighter",
                "rating": "8.8",
                "released": "May 2025",
                "description": "Ghetto Fighter is a fast-paced action game where you take control of the streets and battle rival thugs. You’ll chase down vehicles, unlock new rides, and grow your gang to rule the region. With dynamic action, bold visuals, and smooth controls, every moment pushes you to take charge and rise through the ranks.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/ghetto-fighter/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Ghost Walker",
                "rating": "9.0",
                "released": "November 2022",
                "description": "Ghost Walker is an action game about a ninja who went on a hunt for reputable bandit leaders. This game will amaze you with cool ninja controls in slow Motion and dynamism. Your main task is to destroy the bosses. This is a game in which you will fully feel like an unsurpassed, elusive, super dexterous, and strong master of melee weapons. Try to experience this incredible feeling of elusiveness yourself, defeat all the bandits without a single scratch, and become a legend.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/ghost-walker/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Gladiator: True Story",
                "rating": "9.3",
                "released": "November 2021",
                "description": "Gladiator: True Story is a gladiator arena survival game where you control Bruticus, the destroyer of worlds. This is the story of how you became the greatest gladiator of all time. Based on historical facts. Hack n' slash your way through waves of ultimate fighters and champions. Level up your armor and weapons to do even more damage in this bloody battle arena!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/gladiator---true-story/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Gladiator Fights",
                "rating": "8.7",
                "released": "September 2024",
                "description": "Gladiator Fights is an action fighting game that transports you back to the blood-soaked sands of ancient Rome, where every battle is a fight for survival and glory. As you step into the digitalized Colosseum, you'll feel like a true gladiator, immersed in the brutal world of hand-to-hand combat. Battle your way through fierce arenas, squaring off against formidable foes who will push your strength and strategy to the limit. Each fight is a raw test of skill, where victory means honor and defeat could be your last breath.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/gladiator-fights/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Goblin Punk Tower Defense",
                "rating": "8.6",
                "released": "March 2025",
                "description": "Goblin Punk Tower Defense is a fast-paced strategy game where you battle waves of mischievous goblins. Use futuristic towers to fend off relentless enemies, strategically placing and upgrading defenses to alter their paths. Each wave grows stronger, pushing your tactical skills to the limit. Build the ultimate defense and see how long you can survive the invasion!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/goblin-punk-tower-defense/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Gravity Arena Shooter",
                "rating": "9.2",
                "released": "April 2024",
                "description": "Gravity Arena Shooter is an action shooter game where the laws of gravity bend to your will! Engage in thrilling team battles where each player possesses the unique ability to manipulate gravity, giving you unparalleled freedom of movement and strategic advantage. With dynamic conflicts and heart-pounding action, immerse yourself in a gravity-defying world where victory is within your grasp. Bend the laws, control the battle, and dominate the arena like never before!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/gravity-arena-shooter/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Grimdark Survivors",
                "rating": "8.9",
                "released": "November 2023",
                "description": "Grimdark Survivors is an adrenaline-pumping roguelite game where you have to survive an alien attack. Choose your hero, arm yourself, and prepare to face the relentless darkness. Each hero offers a unique playing style so that each game will feel fresh and exciting. There are many choices of weapons to choose such as precision assault rifles to flamethrowers! Experiment, strategize, and find the perfect weapon that suits your style to conquer the darkness. You will not only face waves of enemies but also tough bosses that will test your braveness. Use the skills and equipment you acquire to achieve victory.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/grimdark-survivors/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Guardians of the Kingdom",
                "rating": "9.0",
                "released": "July 2023",
                "description": "Guardians of the Kingdom is an action-packed fantasy game that takes you on an epic journey to defend the realm from the dragon army of eternity. Strategically deploy your heroes in this Tower Defense adventure, showcasing your tactical brilliance to claim victory. Upgrade your heroes to bolster their strength and face waves of relentless enemies. Unite identical heroes to enhance their powers, and wield the power to control the battlefield. Prepare for an immersive and thrilling battle to safeguard the Kingdom!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/guardians-of-the-kingdom/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Halloween Chainsaw Massacre",
                "rating": "9.1",
                "released": "October 2022",
                "description": "Halloween Chainsaw Massacre is an action game where the city was filled with magical monster pumpkins. Use your chainsaw and destroy all enemies! Saw them apart. Make a long-range throw at the enemy and tear him apart. Use a circular attack and take down all the pumpkins around. Free the city and become a hero!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/halloween-chainsaw-massacre/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Haunted School",
                "rating": "8.5",
                "released": "April 2022",
                "description": "Haunted School is a horror survival game where you search a school for the tools required to exorcise a demonic child. Explore the map looking for clues and supplies. How long will you survive the Haunted School?",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/haunted-school---horror-game/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Haunted School 2",
                "rating": "8.6",
                "released": "January 2023",
                "description": "Haunted School 2 is ahorror gameset ten years after the events in the firstHaunted School. Return once more to the eerie abandoned school to perform another exorcism.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/haunted-school-2---horror-game/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Hero Castle War: Tower Attack",
                "rating": "9.0",
                "released": "June 2024",
                "description": "Hero Castle War: Tower Attack is a 2D action game where you play as Hiro, a ninja trained by master Daiki and his daughter Hana in a secret ninja village. When the vampire king Dakura discovers the village, he kidnaps Hana and leaves his army of corrupted ninjas, giants, dragons, and witches to guard her. Despite the formidable foes, Hiro is determined to rescue Hana. Why did Dakura take Hana? No one knows. Help Hiro reach the highest tower and rescue his beloved now!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/hero-castle-war-tower-attack/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Hero Survivors",
                "rating": "8.3",
                "released": "March 2024",
                "description": "Hero Survivors is an action-roguelike game where you'll face countless waves of menacing spirits in intense battles reminiscent of Vampire Survivors. Choose from three distinct heroes, each with their unique traits, and embark on a journey filled with thrilling adventures and epic challenges. Will you emerge victorious against the spirits, or will you fall in battle like so many before you? The fate of the world hangs in the balance—choose wisely, hero!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/hero-survivors/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Herochero: Enemy Slayer",
                "rating": "8.4",
                "released": "September 2024",
                "description": "Herochero: Enemy Slayer is a thrilling RPG tower defense game where you, as the hero, defend your realm from waves of enemies. Strategically manage tower placement while supplying them with unique ammo types like fire and ice to keep the defense strong. Actively control your hero to repel invaders and protect your base!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/herochero-enemy-slayer/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Hex Color Idle",
                "rating": "8.7",
                "released": "December 2017",
                "description": "Hex Color Idle is a unique idle game in which you must work to develop a range of hexadecimal colors. With over 16,000 different colors to make this game has endless possibilities and will keep you entertained for hours. You must use the 5 paint squares to create a mix of different colors – depending on the mix you have, this will affect your chances of creating a new color.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/hex-color-idle/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Hook Arena",
                "rating": "8.3",
                "released": "August 2024",
                "description": "Hook Arena is an action-packed game where you battle the opponents on opposite sides of a river using unique hook weapons. Your objective is to hook enemies to eliminate them one by one, pull in beneficial rune bottles, or escape by hooking yourself to a physical support like a pole. Before the match, you can choose your team's color, upgrade your character, and change their skin and weapon. In the treasure menu, you can hack and open chests with both a chest and a key. Who knows what secrets they hold, but all items will be placed in your inventory. Fight in matches, earn trophies, and climb the leaderboard rankings. Good luck in the battle!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/hook-arena/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Hook & Slice",
                "rating": "8.7",
                "released": "January 2025",
                "description": "Hook & Slice is a thrilling physics-driven action game where you use a grappling hook to swing and take down enemies with precision. Unlock powerful weapons like katanas and axes to enhance your slicing skills. Embrace the chaotic ragdoll combat as you master the art of swift and strategic attacks in a unique samurai adventure.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/hook-slice/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Horror Nights Story",
                "rating": "8.8",
                "released": "August 2019",
                "description": "Do you ever feel like there are creatures lurking just behind you? Waiting to grab you? In Horror Nights Story this comes true! You must dig down and try to escape from the evil creatures that are following you.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/horror-nights-story/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Horseback Survival",
                "rating": "8.7",
                "released": "March 2024",
                "description": "Horseback Survival is a 2D side-scrolling game where you must run and survive from the zombies attack while you're horse riding. You can play the Level mode or Free Run mode which unlocks after level 5. Upgrade your weapon and purchase different hairstyles and hats in the Shop. Complete the task on your way to reach the well. Good luck!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/horseback-survival/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Hot Lava Floor",
                "rating": "9.0",
                "released": "May 2022",
                "description": "Hot Lava Floor is a parkour game that will remind you back to your childhood imagination. Run and jump onto various objects around you, but be careful, do not let your guard down or you will be drowning in the hot lava! Collect cash along the way to buy chests in the Lava Shop. Try to find keys while you do the parkour to be able to unlock new levels. Play it by yourself or even with your friends in multiplayer mode.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/hot-lava-floor/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Hunter Hitman",
                "rating": "8.5",
                "released": "January 2023",
                "description": "Hunter Hitman is an action game where you play as a hitman armed with just a knife and your skills in the assassination. Sneak up on your enemies and eliminate them all. Kill multiple targets in a short time, and you will get a combo. Earn coins and unlock cards to obtain different character skins. Come back daily to collect daily rewards. Uncover loot boxes that yield cards. Assemble 3 of the same cards to upgrade your characters.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/hunter-hitman/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Hyper Knight",
                "rating": "9.1",
                "released": "November 2023",
                "description": "Hyper Knight is an exciting and action-packed gaming experience where players can immerse themselves in a post-apocalyptic world filled with battles and danger. The game's features, including equipment upgrades, magical abilities, and companion recruitment, provide depth and strategic elements to keep players engaged. The endless adventure aspect ensures that players will always have new challenges to face, and epic boss battles add an extra layer of intensity. So, don your armor, grab your sword, and embark on this epic quest in \"Hyper Knight\" to become humanity's hero in its darkest hour.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/hyper-knight/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Hyperspace: Quantum Fracture",
                "rating": "8.7",
                "released": "April 2025",
                "description": "Hyperspace: Quantum Fracture is a sci-fi shoot 'em up blending roguelike progression, bullet hell intensity, and auto-shooter action. You are on a thrilling journey through deep space, facing relentless enemy swarms. Test your survival skills in the vast unknown.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/hyperspace---quantum-fracture-fez/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Idle Superpowers",
                "rating": "8.3",
                "released": "April 2021",
                "description": "Idle Superpowers is a roguelike idle RPG in which you become a hero with various superpowers to defeat your countless enemies!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/idle-superpowers/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Immortal: Dark Slayer",
                "rating": "9.2",
                "released": "April 2025",
                "description": "Immortal: Dark Slayer is a top-down action RPG that puts you in the armor of a Fallen Knight, battling to purge the realm of demons, the undead, and creeping chaos. Drawing inspiration from the punishing combat of Dark Souls and Elden Ring, it delivers the same gritty challenge, reimagined with a top-down perspective and streamlined controls. Whether you're a seasoned RPG veteran or a newcomer to the genre, this dark fantasy adventure offers a thrilling, accessible experience.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/immortal-dark-slayer/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Infected Days",
                "rating": "9.2",
                "released": "December 2021",
                "description": "Infected Days is an action game where hordes of infected zombies are coming and you become the last home for protection. Destroy waves of zombies supported by tons of boosts, upgrades, perks, and other bonuses and see how far you can go.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/infected-days/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Infinite Heroes",
                "rating": "8.7",
                "released": "December 2022",
                "description": "Infinite Heroes is a board card game where you must join the magical world of adventure. Challenge the monster army and defeat the demon. Simple at first glance, the game will present you with complex challenges. Creatures, artifacts, portals, spells, and heroes. Play as a tireless adventurer, a powerful magician, a great warlock, or any of the eight heroes! Get loot and treasure to win. As you progress, the strength of your opponents will also grow, and to win, you need to think through every step.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/infinite-heroes/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Infinite Launch",
                "rating": "8.7",
                "released": "December 2022",
                "description": "Infinite Launch is an action game where you can explore space and colonize planets. Create satellites so you can collect stars and use them to get a new planet. Fight with the aliens and conquer the universe!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/infinite-launch/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Iron Crusher",
                "rating": "9.2",
                "released": "June 2024",
                "description": "Iron Crusher is an action-packed game where Earth's fate rests on a heroic cat. Play as this fearless feline, shooting down alien invaders and upgrading your abilities with powerful items. Navigate through intense battles, protect the planet, and become the ultimate defender in this thrilling adventure.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/iron-crusher/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Iron Towers Alliance",
                "rating": "8.9",
                "released": "March 2025",
                "description": "Iron Towers Alliance is a thrilling action defense PvP strategy game where you build and defend your tower against players worldwide. Fortify your structure, install powerful weapons, and lead your squad in battles. Team up for assaults, climb the rankings and earn rewards. Unlock achievements, collect parts, and upgrade your units to dominate the battlefield!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/iron-towers-alliance/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Jacksmith",
                "rating": "9.1",
                "released": "May 2021",
                "description": "Jacksmith is a crafting game where you forge weapons for soldiers and join them on the battlefield as they slay monsters. Build the perfect weapons to see the soldiers into battle and give them the greatest chance of success!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/jacksmith/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Janissary Battles",
                "rating": "8.7",
                "released": "June 2020",
                "description": "Janissary Battles is a compilation of 8 retro-pixel games that were part of the popular Janissary series. Hit the play button to play Arrow, Axe, Sword, Mace, Arena, Spear, Catapult and Gun levels, each with a score of 5 to achieve. Keep track of your win count in the \"Scoreboard\" section located at the corner of your screen in the main menu. This game is exclusively available for 2 players.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/janissary-battles/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Jet Fighter Airplane Racing",
                "rating": "8.6",
                "released": "March 2024",
                "description": "Jet Fighter Airplane Racing is an action airplane game where you can complete many different missions, improve your flying skills, and become a true professional in piloting! There are many exclusive airplanes available, such as MiG-21 “Fishbed\", McDonnell Douglas F-4 Phantom II, MiG-29 “Fulcrum”, F-16 Fighting Falcon, MiG-31 BM “Foxhound”, F-22 Raptor, SU-35 “Flanker-E”, SU-47 \"Firkin\", SU-57. Become a skilled fighter pilot in the sky and get lots of adrenaline. Avoid the fly traffic in jet-flying race games! Are you ready for a traffic airplane adventure? Fasten your seatbelt and prepare to fly!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/jet-fighter-airplane-racing/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Sniper Challenge",
                "rating": "8.8",
                "released": "November 2024",
                "description": "Sniper Challenge is a high-stakes shooting game where you play as a sniper tasked with eliminating contestants before they complete intense trials. Use sharp aim to line up each shot and prevent anyone from reaching the ultimate prize. With smooth controls and detailed 3D graphics, every shot counts in this mission-driven experience.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/k-sniper-challenge-3d/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Kill-BOI 9000",
                "rating": "9.1",
                "released": "August 2022",
                "description": "Kill-BOI 9000 is an action game where you must bring hearts to the robot, Kill-BOI, so you can upgrade and make the robot even stronger. You can play this game solo or play with your friend locally. Get ready and beat the monsters out of your way!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/kill-boi-9000/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Kill The Spartan",
                "rating": "9.1",
                "released": "October 2020",
                "description": "Kill The Spartan is a game where you choose ways how the Spartan will die.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/kill-the-spartan/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Kings Clash",
                "rating": "9.3",
                "released": "October 2022",
                "description": "Kings Clash is an action game where you must create your own army by merging minions. Create strong heroes and place them in the area to win the war. Try to be the most powerful player!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/kings-clash/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Krampus",
                "rating": "8.3",
                "released": "July 2022",
                "description": "Krampus is a horror game to put all the items on the plates, activate the spell, and trap Krampus! Can you defeat him?",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/krampus/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Last Play: Ragdoll Sandbox",
                "rating": "8.6",
                "released": "December 2024",
                "description": "Last Play: Ragdoll Sandbox is an action sandbox universe where your creativity takes center stage. Build stunning structures, pilot powerful mechs, and populate your world with lively ragdolls. Enjoy thrilling destruction, uncover quirky melon-themed mini-games, and design imaginative playgrounds. With tools to create and share your own games, the possibilities are endless. What will you create?",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/last-play-ragdoll-sandbox-kqb/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Lime Playground Sandbox",
                "rating": "8.5",
                "released": "April 2024",
                "description": "Lime Playground Sandbox is an action game where you must kill all the zombies. This game offers a unique combination of machine gun shooting, car driving, and destruction. There are three game modes you can play: Sandbox Mode, where you can place any objects you want and play with your imagination. Campaign Mode, where you must complete all the levels and collect 3 lemons at each level. Survival Mode, where you must survive as long as possible from the hordes of zombies. Have fun as you like!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/lime-playground-sandbox/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Little Big Fighters",
                "rating": "8.7",
                "released": "March 2024",
                "description": "Little Big Fighters is an action survival game where you'll embark on a thrilling journey to show the world who truly reigns supreme in the arena of combat. Defeat your opponents, grow stronger with each victory, and collect valuable resources to bolster your power and dominance. Are you ready to prove yourself as the ultimate fighter in an epic battle for survival?",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/little-big-fighters/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Little Robot",
                "rating": "8.6",
                "released": "October 2022",
                "description": "Little Robot is a robot action game where you must destroy your enemies to take control of them and make them fight for you!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/little-robot/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Loot Party",
                "rating": "9.3",
                "released": "June 2023",
                "description": "Loot Party is an action game that introduces a new party mechanic to enhance your gameplay experience. In this game, you embark on a thrilling and perilous journey, gathering a party of brave heroes to accompany you.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/loot-party/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Mad Royale Tactics",
                "rating": "8.6",
                "released": "April 2025",
                "description": "Mad Royale Tactics is a turn-based battle royale where strategy and precision decide your fate. Command a mini tank, plan each move carefully, and unleash tactical shots to outsmart opponents. Use the terrain to gain the upper hand—knock enemies off platforms, deflect incoming fire, or land mid-air hits. Outsmart, outmaneuver, and be the last tank rolling!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/mad-royale-tactics/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Magic Hands",
                "rating": "9.1",
                "released": "September 2022",
                "description": "Magic Hands is a funcasual gamewhere you cast spells on the approaching enemies. Use different key combos tocreate magic spellsand clear the enemies from each level!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/magic-hands/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Magic Tower: Cards War",
                "rating": "8.7",
                "released": "November 2023",
                "description": "Magic Tower: Cards War is a strategic battle game where you must protect the princess so she doesn't get killed by the enemies. Get a deck of fighters and place them in the correct position to win. Combine two of the same units and get a mega-unit! There are also buffers or bonuses to strengthen your troops. Use your tactical skills because each decision gets you closer to victory. Will you successfully protect the princess?",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/magic-tower-cards-war/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Mechs Rumble Blitz",
                "rating": "8.4",
                "released": "December 2024",
                "description": "Mechs Rumble Blitz is an adrenaline-pumping action battle arena game that puts you in the pilot seat of a customizable robot! Prepare to test your skills, strategy, and reflexes in a dynamic arena filled with traps, obstacles, and waves of powerful enemies. Upgrade, customize, and fight to prove you’re the best mech pilot in the world!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/mechs-rumble-blitz/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Medieval Battle 2P",
                "rating": "8.7",
                "released": "February 2022",
                "description": "Medieval Battle 2P is a war strategy game with a medieval theme that you can play by yourself or with your friend. Place your powerful soldiers and set your battle strategy to win the war.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/medieval-battle-2p/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Meme Survivors: Backrooms",
                "rating": "8.9",
                "released": "May 2025",
                "description": "Meme Survivors: Backrooms is a chaotic roguelite romp where internet legends battle for survival in a bizarre, hazard-filled maze. Choose your meme hero—from tearful Banana Cat to thunderous Pop Cat—and unleash wild abilities against waves of absurd foes. Every run is unpredictable, packed with upgrades, surprises, and unfiltered internet absurdity.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/meme-survivors-backrooms-xus/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Merge Age Warriors",
                "rating": "9.2",
                "released": "August 2025",
                "description": "Merge Age Warriors is a strategy game where you command armies across three epic eras. Lead cavemen in the Stone Age, knights in the Medieval Age, and bold scientists in the Modern Age. As you merge and strengthen your forces, you’ll discover creative ways to outwit enemies and shape the course of legendary battles.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/merge-age-warriors/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Merge Army",
                "rating": "9.2",
                "released": "April 2022",
                "description": "Merge Army is a merge battle game where you build up a mighty army for battle. Merge your units to create stronger fighters and take them into the arena. Earn gold for your victories and prepare your military for more brutal battles.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/merge-army/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Merge Cannon: Chicken Defense",
                "rating": "9.2",
                "released": "November 2022",
                "description": "Merge Cannon: Chicken Defense is an action defense and merge game where you protect your castle against an army of chickens. Can you hold back continuous waves of chickens while maintaining defenses?",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/merge-cannon-chicken-defense/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Merge Defense",
                "rating": "9.2",
                "released": "September 2023",
                "description": "Merge Defense is an action-strategy game that melds merging mechanics with intense battles against unrelenting adversaries. As humanity's last bastion, you must merge, adapt, and battle to safeguard your world from encroaching darkness. Engage in high-speed, skill-driven combat against hordes of foes. Defending your realm requires not just brawn but also cunning strategy. Strategically plan your merges to counter various enemy types and their unique abilities.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/merge-defense/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Merge Master Tanks: Tank Wars",
                "rating": "9.3",
                "released": "September 2023",
                "description": "Merge Master Tanks: Tank Wars is a merge 2D tank game that immerses you in a world of authentic cartoon-style tanks. Merge identical tanks, leading them into thrilling battles against formidable foes and challenging bosses. Experience the excitement of tank warfare like never before in this unique gaming adventure.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/merge-master-tanks-tank-wars/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Merge War",
                "rating": "8.6",
                "released": "August 2023",
                "description": "Merge War is a blend of strategy and action, where you can combine slimes, dragons, and monster pets to forge a powerful legion. Compete in the arena against other merge experts. Craft a formidable army by merging, conquering monsters, and challenging super dragons. Unlock rare cards, strategize your deck, and upgrade your legion to claim victory. This game offers thrilling gameplay for both casual and strategic players. Unleash your merging skills, create your legion, and seize the title of ultimate merge master!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/merge-war/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Mini Jumps",
                "rating": "8.7",
                "released": "January 2021",
                "description": "Mini Jumps is a one-button jumping game to jump over the platforms to reach the goal.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/mini-jumps/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Modern Cannon Strike",
                "rating": "9.0",
                "released": "March 2024",
                "description": "Modern Cannon Strike is an action game in which you must launch a missile to destroy your enemy. Aim at the specific location, and then fire! You can easily aim for your enemies by looking at the red target on the tablet and then timing your shots. Enjoy the game, and get ready for the battle!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/modern-cannon-strike/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Monster Box",
                "rating": "9.3",
                "released": "December 2022",
                "description": "Monster Box is acasual gamewhere you capture monsters in capsules and use them to defend yourself! Collect monsters for battles, accept challenges from other trainers, and reward your monsters with play and treats. Create your best team ever!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/monster-box-bae/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Monster Duel",
                "rating": "9.2",
                "released": "December 2022",
                "description": "Monster Duel is a competition of monsters where you must win the battle to get the body parts of your opponent. Merge the best body parts to become fearsome, unlock combinations of overpowering spells, fight more incredible bosses, and become the most feared animal in the world!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/monster-duel/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Monster Life",
                "rating": "9.1",
                "released": "December 2022",
                "description": "Monster Life is an action game where you choose and adopt a monster, and fight in epic battles! Can you beat the big boss?",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/monster-life/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Monster School Herobrine Siren Head",
                "rating": "8.5",
                "released": "July 2022",
                "description": "Monster School Herobrine Siren Head is an action game where you need to kill all of these zombies. Choose your character to play between the girl or Herobrine. You can also choose which world you want to play, Zombies at School or Siren Head in the City Town. Collect lucky boxes so you can place traps for all of these monsters. So, what are you waiting for? Equip your weapon and start the action!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/monster-school-herobrine-siren-head/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Monsters Tactics",
                "rating": "9.3",
                "released": "October 2022",
                "description": "Monsters Tactics is an arena battle game where you choose the best monster combinations to defeat your adversary!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/monsters-tactics/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Mouse Warriors",
                "rating": "8.8",
                "released": "June 2024",
                "description": "Mouse Warriors is a 2D roguelike game where you must upgrade yourself to be much stronger to fight all the monsters in the arena. Fight waves of monsters with your mouse movement. Collect coins and use them to purchase upgrades, characters, and weapons. Be more powerful, defeat bosses, and conquer all the levels!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/mouse-warriors/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Mr. Dude: King of the Hill",
                "rating": "8.4",
                "released": "April 2024",
                "description": "Mr. Dude: King of the Hill is an action game where you play the famous criminal, Mr. Dude. You're escaping from the cops and end up on the top of a mountain, where residents are living and ready to hand you over to the police. Knock out and throw these residents off the cliff and conquer the mountain! There are different objects that you can use as a weapon, throw and swing at your opponents. Grab some food to refill your health bar. With various enemies and interactive ragdoll characters, this game will bring a lot of fun to you!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/mr-dude-king-of-the-hill/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Mr. Throw",
                "rating": "8.0",
                "released": "November 2023",
                "description": "Mr. Throw is an arcade game where you must defeat your opponent by throwing objects at him. Aim and throw all your objects at the enemy to beat him. Even a cute teddy bear can be a deadly weapon! Calculate the force and aim it appropriately. Achieve your victory in this dangerous object-throwing battle!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/mr-throw/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Mutant Escape",
                "rating": "9.2",
                "released": "October 2022",
                "description": "Mutant Escape is an action game where you play as a mutant trying to escape a top-secret laboratory. Choose three powers and use them to escape this mutant prison!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/mutant-escape/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Mutant Fighting Cup",
                "rating": "9.4",
                "released": "October 2018",
                "description": "Mutant Fighting Cup is a 2D fighting game in which you will fight newly generated mutant animals in a tournament to win the cup. You can completely create new mutant species, mix the different gene strands together like a mad scientist to create a new species of animal. Your animal must be strong and fierce to be able to defeat all others in the tournament ahead.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/mutant-fighting-cup/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Mutant Idle",
                "rating": "9.4",
                "released": "April 2023",
                "description": "Mutant Idle is an action game where you play as a professor who creates mutants to fight against the army that has a mutant captive. Defeat them to set the mutants free! The rescued mutants will then fight alongside you, and you can strengthen them by combining their DNA using machines you invented. With more mutants, you can increase the number of slots and create new hybrid mutants. Discover different types of mutants and their unique attack animations as you progress through the game. Unlock new slots to join the battle with more mutants and experience the excitement of creating new species.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/mutant-idle/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Night Watchman",
                "rating": "9.0",
                "released": "July 2022",
                "description": "Night Watchman is ahorror gamewithjump scareswhere you keep watch in the dark. It’s likeHide N Seek, but with scary characters and dangerous dolls that look similar to characters from Four Nights At Freddy's . Cover your eyes and wait to attack - but don’t wait too long!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/night-watchman/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Ninja Escape",
                "rating": "9.2",
                "released": "November 2022",
                "description": "Ninja Escape is an action ninja game where you dodge obstacles and battle samurai. Jump, slide, and dash through each level and tackle all obstacles to proceed to the next level. Unlock new ninja skills as you progress.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/ninja-escape/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Ninja Hands",
                "rating": "9.3",
                "released": "June 2022",
                "description": "Ninja Hands is a casual arcade game where you play as a ninja. Use expert hand movements to deliver epic ninja powers. Learn new combos, upgrade your skills, and customize your ninja in Ninja Hands.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/ninja-hands/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Ninja Hands 2",
                "rating": "9.2",
                "released": "August 2023",
                "description": "Ninja Hands 2 is an action-packed ninja game where you unleash your ninja warrior skills. Generate various abilities and unleash epic combos to combat your foes. Employ strategic thinking to craft potent spells that obliterate enemies and secure victory. Harness your ninja prowess and conquer the challenges that lie ahead!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/ninja-hands-2/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Ninja Parkour Multiplayer",
                "rating": "8.6",
                "released": "May 2024",
                "description": "Ninja Parkour Multiplayer is a 2D game where your objective is to avoid obstacles along your path to the end of the course. Quick movements and precision jumps will get you far. Hesitation will get you straight back to the beginning.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/ninja-parkour-multiplayer/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Noob and Zombies",
                "rating": "8.7",
                "released": "April 2025",
                "description": "Noob and Zombies is a 2D survival action game where your only way out is to fix your car and fight your way through waves of the undead. Trapped in a zombie-infested city, you’ll need to repair broken vehicles while fending off relentless hordes. Kill zombies, upgrade your gear, and survive long enough to make your escape.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/noob-and-zombies/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Noob Tower Defense",
                "rating": "8.3",
                "released": "November 2022",
                "description": "Noob Tower defense is an action game where you build towers and traps for zombie monsters. Get coins after killing zombies and upgrade heroes to take revenge!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/noob-tower-defense/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Noob vs Cops",
                "rating": "9.1",
                "released": "July 2023",
                "description": "Noob vs Cops is an exhilarating survival game where you take on the role of Noob and must escape the relentless pursuit of zombie cops. Navigate your boat, dodge obstacles, and take down zombie cops. Collect points by gathering fish and crabs. Buy new weapons and upgrade your boat. With each thrilling mission, outsmart the zombie cops and become the ultimate pirate with your formidable pirate ship!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/noob-vs-cops/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Noob vs Pro: Zombie Apocalypse",
                "rating": "8.9",
                "released": "June 2022",
                "description": "Noob vs Pro: Zombie Apocalypse is an exciting zombie game with a fun storyline that awaits you. Go through level after level. Noob lives quietly in his small house in the forest, suddenly zombies attacked the world of blocks! Whole hordes of zombies want to destroy everything in their path. Help Noob and Pro to end them. Kill zombies, and destroy everything in your path. Survive in this challenging zombie!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/noob-vs-pro-zombi-apocalypse/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Noob: Zombie Prison Escape",
                "rating": "8.7",
                "released": "September 2023",
                "description": "Noob: Zombie Prison Escape is an action platforming game inspired by the style of Minecraft. Your mission is to help Noob escape from a zombie-infested prison by finding keys, coins, solving puzzles, avoiding traps, and using parkour skills to navigate platforms. Along the way, you'll need to shoot down monsters with a crossbow, complete tasks involving torches, and face various challenges in 10 different levels. Fans of the Noob series and Minecraft-style gameplay will find this game engaging as it features beloved characters and a variety of puzzles and adventures to solve.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/noob-zombie-prison-escape/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "North War",
                "rating": "8.2",
                "released": "December 2023",
                "description": "North War is a war game where you have to conquer the enemy's island! Test your strategy skills to build an army and attack your enemies. Become the most powerful Viking in all the north! Use wood to build a bow and ax factory. Let your troops take their weapons and sail the seas on Drakkar to the enemy's island. Defeat all your enemies and conquer their islands!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/north-war/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Office Brawl - Room Smash",
                "rating": "8.9",
                "released": "January 2025",
                "description": "Office Brawl - Room Smash is a chaotic action game where you become a frustrated employee breaking free from the system. Smash obstacles, battle bosses, and unleash mayhem as you overcome challenging levels. Use your wits and strength to wreak havoc and embrace the thrill of rebellion in an unforgettable journey of destruction and defiance!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/office-brawl---room-smash/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "One Among Zombies",
                "rating": "8.5",
                "released": "February 2024",
                "description": "One Among Zombies is a turn-based strategy game where you must survive the zombies. The majority of the population perished due to the use of poisons and chemicals by the armies. Those who were lucky enough to survive had to wear protective suits and venture to the surface of the contaminated planet in search of remaining useful resources, sustenance, and equipment. As a result of the last war, the dead lost their eternal peace. It is unknown which chemicals were used, but they caused partially decaying bodies to move once again and feel an incredible hunger, which can only be partially satiated by a warm piece of fresh meat.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/one-among-zombies/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Only Up 3D Parkour: Go Ascend",
                "rating": "8.5",
                "released": "August 2023",
                "description": "Explore the secrets of the sky in Only Up 3D Parkour: Go Ascend! This action-packed parkour game takes you on a thrilling upward journey. Climb higher and higher on various floating platforms to uncover the mysteries of this world and test your parkour skills!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/only-up-3d-parkour-go-ascend/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Onslaught 2",
                "rating": "7.7",
                "released": "",
                "description": "Onslaught 2 is a tower defense game to keep attackers away from the base, Area 51. Build your weapons, upgrade your defenses and use earnings to buy upgrades.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/onslaught-2/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Operation Desert Road",
                "rating": "8.8",
                "released": "November 2021",
                "description": "Operation Desert Road is an action game where you drive an armored vehicle and destroy the enemies to clear the Desert Roads!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/operation-desert-road-kck/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Outpost: Zombie Apocalypse",
                "rating": "8.7",
                "released": "August 2023",
                "description": "Outpost: Zombie Apocalypse is an action survival game where you stand as the last survivor against the undead. Your goal: endure as long as you can. Construct strongholds, forge weapons, and lay traps. Survival is paramount, particularly during the perilous night hours. Daytime offers relative safety to gather resources, repair, fortify defenses, set up fixed weapons, lay mines, and illuminate your surroundings. Yet, as darkness falls, you become vulnerable while the zombie horde's senses sharpen. Your only hope is a well-prepared, illuminated base where you must stand your ground to survive until dawn. As each night grows more treacherous, adapt, upgrade, unlock new weaponry and structures, and strive to outlast the relentless zombie onslaught.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/outpost-zombie-apocalypse/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Paint Strike",
                "rating": "9.1",
                "released": "October 2022",
                "description": "Paint Strike is an online shooting game where you battle for paint color domination. Spread your color widely and splatter enemies with paint balls. Every win and kill counts, and you can spend your earnings to buy more powerful weapons and customize your character.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/paint-strike/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Parkour GO",
                "rating": "8.7",
                "released": "April 2022",
                "description": "Parkour: Go is a 3Dparkour gamewhere you tackle various obstacles on foot using acrobatic abilities. Scale them quickly and skillfully to reach the finish line.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/parkour-go-gly/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Penguin Dash",
                "rating": "8.7",
                "released": "June 2025",
                "description": "Penguin Dash is a charming 2D side-scrolling action game where you guide an adorable penguin across shifting ice tiles. With its easy-to-learn controls and playful visuals, anyone can dive into the fun. Time your moves, slide across frosty paths, and see how far your penguin can go in this chilly, cheerful adventure.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/penguin-dash-ixp/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Penguin Massacre",
                "rating": "7.4",
                "released": "February 2021",
                "description": "Penguin Massacre is an arcade shooter that lets you play as a penguin defending his base by shooting all the other penguins trying to take it for themselves. Penguins will protect their nesting grounds no matter what, so give a penguin a gun, and it'll shoot everything that even tries to take what they own.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/penguin-massacre/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Pixels for Christmas",
                "rating": "8.7",
                "released": "December 2020",
                "description": "Pixels for Christmas is an action-platformer game with pixel graphics and a Christmas theme. Hohoho, it's almost Christmas, so get all the golden pixels! No there is no map, it would spoil the ending ;) Merry platforming!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/pixels-for-christmas/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Playground",
                "rating": "8.5",
                "released": "March 2025",
                "description": "Playground is an action sandbox game where creativity meets destruction in an open-ended cubic sandbox! Whether you’re building grand cities, orchestrating epic battles, or just causing mayhem, the possibilities are endless! What will you build or destroy first?",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/playground/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "POOBO Survival",
                "rating": "8.9",
                "released": "July 2024",
                "description": "POOBO Survival is a thrilling survival game where over 30 unique heroes face challenging stages. Collect weapons and green diamonds to enhance your chances of success. Survive 20 intense waves to pass each level. It may seem easy, but it's a tough battle that will test your skills and strategy.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/poobo-survival/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Powerline Guardians",
                "rating": "8.6",
                "released": "August 2025",
                "description": "Powerline Guardians is an intense defense game set on Mars, where you step into the boots of a fearless protector. A team of powerful drills works relentlessly to extract valuable Martian ore, but they rely on five vital power lines to keep running. Swarms of hostile Martian spiders are determined to cut those lines and bring the operation to a halt. Your mission is clear: defend the power lines at all costs. Blast through waves of spiders, repair damaged wires, and ensure the drills stay powered until enough ore is collected. As the attacks grow fiercer, you’ll need sharp reflexes, smart strategy, and quick repair skills to prevent total shutdown. Hold the line, repel the infestation, and secure the ore to complete your mission!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/powerline-guardians/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Prison Break: Architect Tycoon",
                "rating": "8.9",
                "released": "July 2024",
                "description": "Prison Break: Architect Tycoon is an action game in which you are the main prison guard tasked with securing the prison. Your job is to ensure that no prisoners can escape or, worse, kill you, leading to a game over. You start with an empty prison and transform it into a secure facility. Build inmate cells, reinforce doors, install surveillance cameras, and recruit additional guards. Improve your warden to handle a larger population of prisoners efficiently. Each facility offers unique challenges, providing a captivating experience for players of all ages.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/prison-break-architect-tycoon/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Professor Strange",
                "rating": "8.9",
                "released": "August 2023",
                "description": "Professor Strange is an action game where you play as a Supreme Mage. Take down your foes with various thrilling moves. Slash and cut your enemies, teleport them to the other dimension, and use your shield to defend yourself. Use your magical superpower and save the world!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/professor-strange/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Punch Max",
                "rating": "9.0",
                "released": "May 2025",
                "description": "Punch Max is a high-energy action game starring Max, a super-powered boxer fighting to reclaim his city from lurking evil. Use Max’s unique stretching punches to strike enemies from a distance as you battle through hideouts packed with traps, gear, and fierce bosses. Customize your gloves, power up, and master every level with explosive combos and tactical strikes.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/punch-max/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Puppet Fighter 2 Player",
                "rating": "8.8",
                "released": "November 2022",
                "description": "Puppet Fighter 2 Player is a game you can play with your friend locally. Challenge your friends in this fun game with minimalistic graphics.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/puppet-fighter-2-player/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Ragdoll Ninja: Imposter Hero",
                "rating": "9.4",
                "released": "July 2025",
                "description": "Ragdoll Ninja is a wild physics-based fighting game where you unleash chaotic ninja moves in over-the-top stickman battles. You’ll swing, tumble, and strike with unpredictable flops as you dodge attacks and take down sneaky imposters. Every fight is packed with comedy, action, and ridiculous ragdoll fun you won’t want to miss.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/ragdoll-ninja-imposter-hero/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Random Cards: Tower Defense",
                "rating": "8.2",
                "released": "February 2023",
                "description": "Random Cards: Tower Defense is a tower defense game where you must use your strategy to decide which cards you will use for the battle. Each card has its own strength and its own power. Keep in mind that in order to win, you will need to calculate all the actions. Play out different tower defense scenarios, make wise decisions, and improve your cards.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/random-cards-tower-defense/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Red Stickman vs Monster School",
                "rating": "9.1",
                "released": "December 2022",
                "description": "Red Stickman vs Monster School is an action game where you play as a stickman who has to fight various monsters and zombies. Beat them all and participate in the Monster School challenge together with the Red Stickman. Check out ourstickman gamesfor more!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/red-stickman-vs-monster-school/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Red Stickman vs Monster School 2",
                "rating": "9.1",
                "released": "January 2023",
                "description": "Red Stickman vs Monster School 2 is a platformer shooting game where you battle mobs with bullets. Now the stickman is armed with a pistol, machine gun, uzi, rocket launcher, laser gun, RPG, and much more! Shoot through your undead foes and reach the end in this action-packed stickman adventure! Check out ourstickman gamesfor more.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/red-stickman-vs-monster-school-2/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Rhythm Knight",
                "rating": "8.9",
                "released": "April 2023",
                "description": "Rhythm Knight is a 2D dungeon rogue-lite game where you can embark on a perilous journey as a knight who is tasked with uncovering the mystery of a cursed dungeon. Progress through the dungeon and unlock new weapons and spells to defeat a huge variety of enemies and challenging bosses. Use music and rhythm to time your moves and attacks in this turn-based RPG. Every run is unique, and there will be new weapons and spells as the game goes on. The game features both a story mode and endless game modes.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/rhythm-knight/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Rio Rex",
                "rating": "8.6",
                "released": "July 2018",
                "description": "Rio Rex - cause destruction in Brazil! This time you are let loose in the beautiful Rio de Janeiro but take a look back at the previous cities that have been destroyed in Mexico Rex and LA Rex.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/rio-rex/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Riot Assassin",
                "rating": "8.9",
                "released": "December 2023",
                "description": "Riot Assassin is a casual assassin game where you complete various missions to earn money. Retrieve the assassination contract from the guild dungeon, search and find your target on the streets, and kill them! Use your rewards to buy and upgrade your equipment. Get ready, assassin!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/riot-assassin/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Robot Police Iron Panther",
                "rating": "8.9",
                "released": "August 2019",
                "description": "When the monster alien come to attack the earth, there's nobody can save us except the police robot. Build your own Iron Panther robot and fight the monster in epic fighting! Looking for more challenges? Hop on toCrash Arena Turbo Stars.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/robot-police-iron-panther/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Robowars",
                "rating": "8.2",
                "released": "August 2024",
                "description": "Robowars is a thrilling 2D-pixel art game where you battle as one of humanity's last survivors against powerful robots in a futuristic world. Explore procedurally generated rooms, defeat robotic monsters with quick reflexes, and collect powerful weapons from four elemental categories. Every adventure offers a unique challenge in the fight to save humanity.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/robowars/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Rooftop Snipers",
                "rating": "9.2",
                "released": "June 2017",
                "description": "Rooftop Snipers is a chaotic two-button action sniper game where you can only shoot and jump. You can play the game with a friend or on the computer. It’s one of our many amazing two-player games you can play with friends!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/rooftop-snipers/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Rumble High",
                "rating": "8.6",
                "released": "June 2025",
                "description": "Rumble High is a wild 2D fighter where rebellious students clash in chaotic, no-rules showdowns for campus supremacy. Master crazy combos with smooth controls, pick from a roster of unique fighters, and rise through tournament mode to claim the crown. Fast, fierce, and full of attitude—class just got dangerous.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/rumble-high/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Run",
                "rating": "7.8",
                "released": "",
                "description": "Run! Avoid the holes in the corridor. Run into the walls to rotate the screen. The best game in these series is definitelythe last one, Run 3. You should go play it now!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/run/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Run 3",
                "rating": "8.9",
                "released": "June 2014",
                "description": "Explore outer space in Run 3. Run 3 is an incredibly addicting, endless runner-type action/platforming game in which you play as a little grey alien. The little alien is trespassing in an architecturally challenged area that is floating in space. After trespassing in the prohibited zone which is full of increasing amounts of dangerous holes, you run. If you fall into one of the holes, you will find yourself lost in space so make sure to watch your step!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/run-3/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Runic Curse",
                "rating": "8.8",
                "released": "May 2025",
                "description": "Runic Curse is an action-adventure game where you step into the boots of Adrian, a shipwreck survivor stranded on a mysterious island. As you explore ancient ruins and cursed lands, uncover the secrets behind the Rune Curse and search for your lost crew. Face danger, solve mysteries, and embrace your fate in a world shrouded in shadows.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/runic-curse/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Samurai Madness",
                "rating": "8.6",
                "released": "December 2021",
                "description": "Samurai Madness is an action game that is a mix of roguelite, action, and casual play styles. Lead the fierce samurai warrior on his way to take vengeance on the evil syndicate! Prove your dexterity in this action game full of challenging encounters. Be smart, fast, and agile. Make wise and swift decisions.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/samurai-madness/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Sandbox City",
                "rating": "9.0",
                "released": "December 2021",
                "description": "Sandbox City - Cars, Zombies, Ragdolls! is a zombie game where you can explore freely and drive around the city, but, be careful of the zombie's infection! Find the zombies and kill them before the infection spreads around and the city.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/sandbox-city---cars-zombies-ragdolls/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "School Wars",
                "rating": "8.6",
                "released": "April 2020",
                "description": "School Wars is a real time strategy game that pits 4 different schools against each other in a huge turf war. You'll be playing as the gray school, and you'll attempt to take over by letting your units sit on the card face tiles until it changes to your school's color. The more tiles you control, the faster you'll get extra fighters. You win the game by taking over all of the tiles on screen.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/school-war/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Senya and Oscar vs Zombies",
                "rating": "9.1",
                "released": "October 2023",
                "description": "Senya and Oscar vs Zombies is a 2D side-scrolling game where you play as Senya, who needs to survive the zombie apocalypse. Later, you will find a cute orange cat that you named Oscar, and it will accompany you to kill all the zombies! Loot some useful items to equip such as helmet, armor, and weapon. Collect money and use it to upgrade yourself. Get ready to survive in the zombie world.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/senya-and-oscar-vs-zombies/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Shadow Ninja Revenge",
                "rating": "9.2",
                "released": "March 2022",
                "description": "Shadow Ninja Revenge is an action-platformer game where you play as a ninja seeking revenge on a man named Takeda who kidnapped your son. Use your shuriken and sword to take down the enemies and dash through the environment to the next stage.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/shadow-ninja-revenge/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Shark Simulator Beach Killer",
                "rating": "8.5",
                "released": "September 2017",
                "description": "Shark Simulator Beach Killer is exactly as it sounds – a simulation that allows you to control a 3D shark in shallow waters and the aim is to attack any living thing and rack up a huge amount of kills! This game certainly isn’t for the feint hearted and there is a lot of blood and gore so be prepared! The controls are simple – you control the shark using the WASD keys and attack using the space bar.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/shark-simulator-beach-killer/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Silent House",
                "rating": "7.8",
                "released": "May 2019",
                "description": "You woke up and found yourself locked in a strange room. You also find out that you are not alone! Silent House is a horror game with deep gameplay that is all about trying to conquer your fear and escape from the horrors.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/silent-house/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Silly Walkers",
                "rating": "8.7",
                "released": "May 2023",
                "description": "Silly Walkers is an action game where you can design and create your robot. The goal of the game is to save the town from Monsters. Use your robot to navigate obstacles and overcome challenges to save the day. Will you be able to complete your mission and save the city? It's up to you to find out in Silly Walker.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/silly-walker/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Siren Head: Playing in the Forest",
                "rating": "8.4",
                "released": "July 2023",
                "description": "Siren Head: Playing in the Forest immerses you in a gripping action game where an accident leaves you stranded in a dark forest. Your sole objective is to escape this eerie nightmare, but the terrifying Siren Head stands in your way. Survive the encounter and gather car parts to repair your vehicle and flee from this horrifying creature. Beware of the imposing and haunting 3D model of the Lilac-Headed monster, ready to send shivers down your spine. Experience an unexpected plot as you strive to survive and confront the Siren Head. Brace yourself for an intense final battle, where your skills will be put to the test in this chilling horror story. Can you conquer the nightmare and save your family?",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/siren-head-playing-in-the-forest/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Skibidi Battle",
                "rating": "8.1",
                "released": "September 2023",
                "description": "Skibidi Battle is an action-packed shooting game where you face off against mischievous foes in fast-paced battles. Armed with powerful weapons, your goal is to outshoot and outsmart your enemies as you navigate through exciting levels filled with challenges. Test your reflexes, aim, and strategy as you take down waves of tricky opponents. Are you ready to rise victorious in the ultimate Skibidi showdown?",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/skibidi-online/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Slash Royal",
                "rating": "9.3",
                "released": "May 2022",
                "description": "Slash Royal is a casual survival game where you fight until you’re the last player standing. Dash around the map securing various weapons to use against your opponents. Whittle your enemies down to none and be the only survivor in the arena to win the match.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/slash-royal/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Slasher",
                "rating": "9.0",
                "released": "February 2023",
                "description": "Slasher is a stickman action game where you slash down your opponents. Get money to buy random items and merge them to make a better weapon and head armor. Let the stickman deathmatch begin!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/slasher/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Smash Block Arena",
                "rating": "8.8",
                "released": "June 2025",
                "description": "Smash Block Arena is a chaotic boxing game where you dive into ragdoll mayhem with wild physics and unpredictable brawls. Pick your blocky fighter, drag to move, and unleash outrageous punches in fast-paced arenas. With random weapons, quick matches, and hilarious knockouts, every fight turns into a stunt-filled showdown of pure, blocky madness.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/smash-block-arena/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Smile Slime",
                "rating": "8.9",
                "released": "October 2023",
                "description": "Smile Slime is a physics arcade game where you take control of the orange slime ball that always smiling to smash and destroy the enemy's head using amazing speed and agility. Slow down time and aim at the enemy's head. Try to bypass all the difficult and tricky obstacles. Good luck!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/smile-slime/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Sonny",
                "rating": "9.0",
                "released": "July 2020",
                "description": "Sonny is an epic RPG-battle game.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/sonny/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Soul Grinder",
                "rating": "8.6",
                "released": "March 2022",
                "description": "Soul Grinder is a survival game to avoid and use your dark magic power to kill your enemies. Try to survive as long as you can and don't forget to collect the gems to upgrade your power.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/soul-grinder/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Soul Not Found",
                "rating": "8.8",
                "released": "September 2020",
                "description": "Soul Not Found is an idle-incremental game with an undead army and battle theme.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/soul-not-found/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Space Cats Battle Arena",
                "rating": "8.3",
                "released": "October 2023",
                "description": "Space Cats Battle Arena brings an action-packed fusion of space shooter and battle arena genres. Create your unique space battleship by merging blocks with an array of weapons, armor, generators, lasers, rockets, and more. Engage in thrilling PvP duels in the cool arena of war strategy. Unlock new technologies, craft loot, and build your dream battleship. Customize your ship for speed, power, or impenetrable defenses using different blocks with unique abilities. With 14 maps, 35 types of weapons, blocks, and devices, the outer space sandbox war strategy offers endless possibilities. Challenge your friend to PvP battles and immerse yourself in the mayhem space shooter war. Take command, launch your powerful ship, and dominate the master duel space battle!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/space-box-battle-arena/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Space Flight",
                "rating": "9.1",
                "released": "March 2023",
                "description": "Space Flight is a pixelated survival game set in space. Fly your ship around and keep it intact through an endless barrage of missile attacks. Collect power-ups to help you survive for longer. Save up your money and use it to buy new spaceships that are cooler and more powerful!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/space-flight/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Space Hex: War Merge Shooter",
                "rating": "9.1",
                "released": "July 2025",
                "description": "Space Hex: War Merge Shooter is a strategic space shooter where every hex on your ship shapes the outcome of battle. Merge special galaxy weapons to boost firepower, gain extra lives, or create shields. Equip your ship wisely and fine-tune your tactics as you face relentless waves of enemies in this immersive space fight simulator.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/space-hex-war-merge-shooter/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Space Survivor",
                "rating": "8.9",
                "released": "November 2022",
                "description": "Space Survivor is a 2D action game where you must survive by killing the aliens. Start the game with one skill of your choice and progress by filling your experience bar to get new skills and upgrades. Avoid touching the enemies, and stay alive!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/space-survivor/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Space Wars Battleground",
                "rating": "8.7",
                "released": "February 2024",
                "description": "Space Wars Battleground is an action battle game set in a faraway galaxy where battles are fast, numerous, and to the death. The game features numerous characters that you play with and against people from around the world to dominate the competitive leaderboard and reach the heights of galactic victory with the support of your fellow fighters.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/space-wars-battleground/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "SpaceWars",
                "rating": "9.0",
                "released": "November 2023",
                "description": "SpaceWars is an action merge game with a cool galactic theme. Combine various space troops, space robots, and spaceships to create mighty armies in distant galaxies. Get to the space battle and destroy your opponents. May the merge be with you!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/spacewars/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Spearfishing",
                "rating": "8.4",
                "released": "August 2025",
                "description": "Spearfishing is a realistic underwater adventure where you explore lakes, seas, and oceans in search of marine life and hidden treasures. Armed with scuba gear and an upgradeable harpoon, you’ll hunt over 30 species, from carp to sharks, while navigating coral reefs and avoiding deadly predators. Each dive brings new challenges, rewards, and breathtaking discoveries.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/spearfishing/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Spider Boy Run",
                "rating": "8.3",
                "released": "July 2023",
                "description": "Spider Boy Run is an arcade game that puts you in the shoes of Spider Boy, leaping across rooftops and evading obstacles. Collect skill cards to perform acrobatic jumps, tap to soar high, and experience the thrill of mid-air maneuvers and graceful landings. It's a fast-paced adventure that will keep you hooked!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/spider-boy-run/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "SpiderDoll",
                "rating": "8.7",
                "released": "March 2021",
                "description": "SpiderDoll is a Spider Rope Hero game. Swing through New York City wrapping bad guys in your web and getting closer to saving Mary. Escape OctoPuppet and battle Green Goblin using your SpiderDoll abilities. Run, swing, and shoot your way through the city!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/spiderdoll/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "SquadBlast",
                "rating": "8.5",
                "released": "January 2024",
                "description": "SquadBlast is an action multiplayer game, a run-and-gun shooter set in the dystopian world set in 2042. With deep class-based combat, each hero brings unique abilities to the battlefield, requiring strategic mastery for victory. The game seamlessly blends the intensity of FPS gameplay with dynamic movement options, offering a refreshing take on the genre. Engage in meaty multiplayer modes, explore diverse maps, and wield various weapons, from assault rifles to experimental supa weapons. Join the fight against oppressive forces, where every bullet matters, and skill reigns supreme.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/squadblast/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Steam Heart",
                "rating": "9.2",
                "released": "November 2024",
                "description": "Steam Heart is a thrilling 2D puzzle platformer game set in a captivating steampunk world. Step into intricate, gear-filled environments where your mission is to fuel each level’s steam engine by collecting coal, adjusting valves, and releasing steam. Unlock the safe to reveal the hidden artifacts.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/steam-heart-nqh/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Stick Archers Battle",
                "rating": "8.3",
                "released": "November 2022",
                "description": "Stick Archers Battle is a fun archery game you can play by yourself or with your friend locally. Try to shoot arrows at your opponent by adapting to the changing environments and physics. Guess the right angles and distance so your arrows can get to your friend accurately. The one who reaches five scores first will win the game.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/stick-archers-battle/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Stick Epic Fighter",
                "rating": "8.2",
                "released": "October 2024",
                "description": "Stick Epic Fighter is an action-packed, arcade physics-based fighting game where you are in control of a stick fighter to battle enemies in a dynamic, geometric world. Your mission is to evolve your character into an unstoppable force by unlocking powerful upgrades, mastering epic combos, and unleashing devastating fatalities that will destroy your foes. Conquer waves of enemies with precision and skill as you dominate each battle. Only after crushing every opponent will you unlock the portal to the next level, where even more significant challenges await. Sharpen your reflexes, perfect your strategies, and prove you have what it takes.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/stick-epic-fighter/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Stick Ragdoll Battle Simulator",
                "rating": "9.3",
                "released": "July 2025",
                "description": "Stick Ragdoll Battle Simulator is an action-packed strategy game that throws you into chaotic stickman warfare powered by wild ragdoll physics. Assemble your army, plan your formations, and unleash all-out battles where strategy meets slapstick mayhem. Every clash is unpredictable, every victory satisfying—can you outwit the madness and lead your stick forces to triumph?",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/stick-ragdoll-battle-simulator/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Stickman Archero Fight",
                "rating": "9.0",
                "released": "November 2022",
                "description": "Stickman Archero Fight is a stickman action arcade game where you take control of a skilled stickman warrior and battle through waves of enemies using a variety of powerful weapons. As you progress, you'll move through different portals, each leading to new stages filled with increasingly tough opponents. Upgrade your stickman’s abilities, equip stronger weapons, and unlock special skills to become an unstoppable fighting machine. The fast-paced combat, strategic weapon choices, and thrilling challenges keep you on your toes as you fight to conquer every level and rise to the top of the leaderboard!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/stickman-archero-fight/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Stickman Army: The Defenders",
                "rating": "8.9",
                "released": "August 2016",
                "description": "The green army is fighting the red army in an epic battle... Defend the White House at all costs and become victorious!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/stickman-army-the-defenders/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Stickman Bullet Warriors",
                "rating": "8.9",
                "released": "January 2022",
                "description": "Stickman Bullet Warriors is a stickman shooting game to take down the other stickman enemies. Try to use as few bullets as possible to get a perfect score.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/stickman-bullet-warriors/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Stickman Clash",
                "rating": "8.6",
                "released": "December 2024",
                "description": "Stickman Clash is a thrilling action battle game where you battle as stickman warriors armed with an array of exciting weapons. Engage in fast-paced combat, outsmart opponents, and showcase your skills in dynamic arenas. The game's captivating action and challenging mechanics keep you hooked as you strive to become the ultimate stickman champion!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/stickman-clash/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Stickman Destruction 3 Heroes",
                "rating": "9.2",
                "released": "March 2021",
                "description": "Stickman Destruction 3 Heroes is a ragdoll physics action game. Crash the stickman into obstacles, send him tumbling down staircases and through walls into oblivious bystanders. Cause as much destruction as possible to earn the most gold!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/stickman-destruction-3-heroes/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Stickman Fighting: Super War",
                "rating": "9.0",
                "released": "August 2022",
                "description": "Stickman Fighting: Super War is a ragdollphysics gamewhere you fight with other stickman warriors and be the supreme hero. Choose your weapon and attack enemies in this epic stickman battleground!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/stickman-duelist-supreme-war/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Stickman Epic",
                "rating": "9.0",
                "released": "October 2023",
                "description": "Stickman Epic is a fast-paced action arcade game that puts your fearless stickman hero on a mission to eliminate hordes of relentless zombies. In this adrenaline-charged adventure, your objective is to battle through waves of enemies while upgrading your character to become stronger and more resilient to even more difficult challenges along the way to victory.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/stickman-epic/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Stickman Fighter: Mega Brawl",
                "rating": "9.2",
                "released": "August 2020",
                "description": "Stickman Fighter: Mega Brawl is a stickman battle game in which you must survive from the enemies by attacking them at the right moment.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/stickman-fighter-mega-brawl/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Stickman Fighting 3D",
                "rating": "8.9",
                "released": "November 2019",
                "description": "It is time to fight. Choose your favorite stickman and perform awesome combos to take the opponents down!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/stickman-fighting-3d/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Stickman King",
                "rating": "8.3",
                "released": "December 2024",
                "description": "Stickman King is an action-packed arcade adventure where you guide a brave stickman through four distinct biomes. Face relentless enemies and defeat powerful bosses to prove your strength. Each battle tests your skill and agility as you strive to claim the title of King of Stickmen. Do you have what it takes to reign supreme?",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/stickman-king/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Stickman Kombat 2D",
                "rating": "9.3",
                "released": "August 2025",
                "description": "Stickman Kombat 2D is an action-packed fighting game where you battle unique characters, each with their own moves, styles, and special attacks. Fight your way through challenging towers, defeating enemies to unlock new fighters and test your skills. The game delivers thrilling effects, including camera shakes, flashes, zooms, animations, and powerful special moves, that make every fight feel intense. With deep mechanics such as stamina management, combo chains, juggling airborne foes, and mastering blocks and breakers, Stickman Kombat 2D challenges you to take control of the fight or lose it.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/stickman-kombat-2d/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Stickman Miners Wars",
                "rating": "9.1",
                "released": "November 2023",
                "description": "Stickman Miners Wars is a defense game where the bad guys take your kingdom, and as a king, it is your job to get it back! Recruit different armies like warriors, archers, wizards, and miners to help you out. Command them to attack the enemy's towers and castle. Collect gold and mine resources to make your kingdom stronger. Defend your towers and castle from bad guys and take over theirs! Can you save the kingdom?",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/stickman-miners-wars/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Stickman Parkour Master",
                "rating": "9.0",
                "released": "September 2023",
                "description": "Stickman Parkour Master is an action parkour game where you help the stickman jump over obstacles, climb ledges, and get to the portal! There are many cool skins available that you can collect. Upgrade your desktop display in the main menu to make it look more fun! Run through many biomes, perform tricks along your way, and conquer all the levels.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/stickman-parkour-master/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Stickman Project",
                "rating": "8.9",
                "released": "July 2025",
                "description": "Stickman Project is a 2D physics-based action battle game where you take on your opponents by unleashing mutant chaos. You’ll battle through dynamic levels using fluid combat and fast reflexes. Choose between endless more or level-based missions and test how long you can survive in this intense, stick-figure showdown. Made by Neron's Brother, Creators of Supreme Duelist.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/stickman-project-bnw/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Stickman Sword Fighting 3D",
                "rating": "8.8",
                "released": "November 2019",
                "description": "You are a stickman warrior with a mission to cleanse hordes of enemies in different stages of history.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/stickman-sword-fighting-3d/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Stickman WW2",
                "rating": "9.3",
                "released": "June 2022",
                "description": "Stickman WW2 is a war strategy game with to fight for any country in World War 2! Assemble the most powerful army of stickmen from machine guns, flamethrowers, cannons, and tanks. Take command of an army, conquer the world, and achieve great victories! Let the strongest stickman armies win the war in this funstickman game!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/stickman-ww2/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Stickman Zombie vs Stickman Hero",
                "rating": "8.8",
                "released": "September 2023",
                "description": "Stickman Zombie vs Stickman Hero is an action platform game where you can play both as a hero and a zombie boss. When you play as a stickman hero, shoot all the zombies and gather other stickmen to be your allies. When you play as a zombie boss, you need to chase the stickman hero and make all his allies to be zombies. Good luck!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/stickman-zombie-vs-stickman-hero/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Street Fighter Simulator",
                "rating": "8.7",
                "released": "November 2024",
                "description": "Street Fighter Simulator is an action-packed fighting game where you rise through the ranks by mastering your combat skills, unlocking new abilities, and battling fierce opponents in dynamic and immersive environments. Whether you’re in Arcade Mode enjoying custom battles or in Career Mode earning your place as a champion, every fight brings you closer to becoming the Ultimate Street Fighter.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/street-fighter-simulator/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Summoner Master",
                "rating": "9.4",
                "released": "May 2023",
                "description": "Summoner Master is a captivating action game where you summon powerful creatures to help you defeat your enemies. Use your strategic skills to summon the right monster and choose the perfect time to unleash their devastating attacks. With each level, your enemies become more challenging, and you must adapt your strategy to succeed. Become the master summoner and claim victory over your opponents in this thrilling adventure.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/summoner-master/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Super Spin",
                "rating": "8.9",
                "released": "November 2023",
                "description": "Super Spin is an action battle game that combines the thrill of merging mechanics with intense, high-stakes spinner battles in a fast-paced arena setting. The game brings dynamic gameplay, strategic challenges, and vibrant visuals with every spin, creating an electrifying gaming experience. Customize and craft your ultimate spinner by merging powerful components, then enter real-time battles where you’ll need skill, speed, and strategy to come out on top.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/super-spin/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Super Thrower",
                "rating": "9.1",
                "released": "August 2024",
                "description": "Get ready for an arcade-packed adventure in Super Thrower, an adventure game where precision meets chaos! You’ll navigate levels by launching objects at enemies with a powerful throw that’ll leave them flying to their demise. With every toss, you’ll need sharp strategy and aim to conquer the level, and if you’re not quick enough, it could be game over. Amp up your gameplay by unlocking skins that let you take on the battlefield in serious style. Whether you're flinging with finesse or unleashing pure mayhem, Super Thrower will have you hooked!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/super-thrower/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Super Utilizer",
                "rating": "8.6",
                "released": "April 2025",
                "description": "Super Utilizer is a thrilling arcade space shooter blending fast-paced action with match-3 strategy. Embark on a daring mission to clean up space by battling bizarre monsters, sorting interstellar trash, and upgrading your spaceship. Protect trade routes, conquer challenging bosses, and dive into modes like \"Survival\" and \"Invasion.\" Adventure awaits beyond the stars—gear up and make your mark!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/super-utilizer/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Survival Hero: Merge RPG",
                "rating": "9.1",
                "released": "October 2023",
                "description": "Survival Hero: Merge RPG is an action game in a fantasy world where you must battle with wild animals, evil monsters, and even scary dragons! Merge and equip your hero with a powerful weapon and strong cuirass. You have been called upon to save the world. Become an invincible knight or archer, try to level up, kill enemies, and buy and merge equipment to become stronger!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/survival-hero-merge-rpg/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Swop Shoot",
                "rating": "8.8",
                "released": "August 2022",
                "description": "Swop Shoot is a shooting game where you control these 2 stickmen as a single unit. The blue stickman can only kill the blue enemies, and the red stickman can only kill the red enemies. Once you reach the end of the stage, you will merge and become the purple stickman to kill the boss.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/swop-shoot/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Takeover",
                "rating": "9.3",
                "released": "May 2021",
                "description": "Your kingdom is at war! Build up your armies, defeat your enemies, and take over their cities in this mouse-controlled real-time fantasy strategy game.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/takeover/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Tank Battle: War Commander",
                "rating": "9.1",
                "released": "December 2017",
                "description": "Tank Battle: War Commander is an epic turn based strategy game in which you must choose to fight for either the Axis or Allied powers during World War 2. Whichever side you choose, you must fight to repel the enemy invasion and eradicate their forces. During each turn, you must choose which course of action to take – you can choose between three different actions. Once you have chosen, a slot machine will randomly decide how effective your actions were.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/tank-battle-war-commander/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Tank Merge Royal",
                "rating": "9.1",
                "released": "September 2023",
                "description": "Tank Merge Royal is an action game that combines elements of tank warfare, strategy, and resource management. In this game, players are tasked with merging various materials to craft and customize their own tanks, which they then use to engage in battles against other players.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/tank-merge-royal/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Tank Wars",
                "rating": "8.4",
                "released": "June 2023",
                "description": "Tank Wars is an action game where you engage in explosive 3D turn-based tank warfare! Experience intense battles with strategic tactics and thrilling action. Choose from 5 unique tanks and navigate meticulously designed maps. Unleash devastating power-ups and dominate the battlefield. Play single, two, or four-player game modes, including a challenging campaign. With stunning graphics and addictive gameplay, Tank Wars delivers the ultimate tank warfare experience. Get ready for explosive battles and become the master of strategic tank tactics!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/tank-wars-iaw/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "TankCraft",
                "rating": "8.6",
                "released": "October 2023",
                "description": "TankCraft is a battle tank game where you must take revenge on the villain who infected your tank mate and turned them into an evil tank. Find out who did it and destroy him. Build the strongest tank and install a super gun on it so you can defeat all your enemies. Don't forget about the super boosters also! Only by building the best and strongest tank, you can defeat all the evil tanks and their bosses.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/tankcraft/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Tanks 2D: Tank Wars",
                "rating": "8.9",
                "released": "October 2022",
                "description": "Tanks 2D: Tank Wars is a tankbattle gamewith various tanks to buy and upgrade, and wars to be fought. Mine gold to upgrade yourtanksand buy new vehicles. Jump into the game and fight on the fields of vehicular combat.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/tanks-2d-tank-wars/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Tanks 2D: War and Heroes!",
                "rating": "8.3",
                "released": "October 2023",
                "description": "Tanks 2D: War and Heroes! is an epic tank battle game where you can buy tanks, upgrade them, and start the battle! There are many selections of real historical tanks to play. Equip yourself with repair kits and missile weapons to destroy a wide range of unique enemies and bosses. Can you defeat them all?",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/tanks-2d-war-and-heroes/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Tanks Arena io: Craft & Combat",
                "rating": "8.5",
                "released": "September 2023",
                "description": "Tanks Arena.io: Craft & Combat is a thrilling PvP action tank battle game where you are combating intense tank wars with a vehicle built and customized by none other than yourself. You will get to challenge players from around the world, so be prepared for plenty of surprises and a variety of strategies from your opponent.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/tanks-arena-io-craft-combat/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Tanks of the Galaxy",
                "rating": "8.5",
                "released": "July 2023",
                "description": "Tanks of the Galaxy is a top-down tank shooter game that delivers explosive 2D warfare. Engage in thrilling battles as you annihilate enemy tanks and obliterate environmental obstacles. Utilize a wide range of weapons to dismantle your adversaries while skillfully evading their attacks. Stay resilient with shields to emerge victorious. Liberate planets from invading tanks, earn coins, and enhance your tank with powerful upgrades and weapons. Immerse yourself in addictive gameplay and dominate the battlefield!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/tanks-of-the-galaxy/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Tanks PVP Showdown",
                "rating": "7.7",
                "released": "March 2022",
                "description": "Tanks PVP Showdown is a real-time multiplayer PvP action game to destroy your opponent's tank. You can use a variety of weapons to deal massive damage to your enemies. Earn some money to unlock new stronger tanks.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/tanks-pvp-showdown/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Tanks vs Zombies: Tank Battle",
                "rating": "8.8",
                "released": "July 2023",
                "description": "Tank vs Zombies is an action-packed tank game where you engage in thrilling battles against hordes of zombies and challenging bosses. With a wide range of tanks and skins to choose from, such as the Mause, E 100, T-35, and more, players can tailor their experience to their preferences. The inclusion of unique elements like well-aimed shots, bullet ricochets, and dangerous traps adds depth and excitement to the game. Strategic use of secret traps like circular saws, spikes, and concrete blocks enhances the tactical aspect of the battles.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/tanks-vs-zombies-tank-battle/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Tavern Rumble: Roguelike Card",
                "rating": "8.9",
                "released": "December 2023",
                "description": "Tavern Rumble is a strategy roguelike deckbuilding card game. Begin your adventure with basic mercenary cards, strengthen your deck, and face challenging bosses. Explore card synergies and experience a roguelike journey with random dungeons, loot, mercenaries, and permanent death. Craft a unique deck, encounter creatures, take blessings, and become a legendary monster slayer. The game offers playable classes, cute pixel art, easy-to-learn mechanics, and the ability to play offline or online. Play now for a perfect card game break!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/tavern-rumble-roguelike-card/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Temple of Fire",
                "rating": "8.9",
                "released": "April 2025",
                "description": "Temple of Fire is an action survival game where you fend off waves of shadow monsters invading your sacred ground. Launch blazing fireballs, gather coins, and push your upgrades to the extreme. Survive the relentless onslaught for 15 intense minutes, and prepare yourself to confront the terrifying final foe—the Unspoken Horror.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/temple-of-fire/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "The Spear Stickman",
                "rating": "9.0",
                "released": "June 2019",
                "description": "The Spear Stickman is a fun and fast-paced stick game of brutal spear throwing combat. You control a stickman armed only with a spear - you must kill the other stickmen who appear at random on different platforms and attempt to kill you. Using your mouse you must adjust the angle of your shot and aim quickly to take down your foe!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/the-spear-stickman/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Tiger Simulator 3D",
                "rating": "8.9",
                "released": "April 2018",
                "description": "Tiger Simulator 3D is a simulation game developed by CyberGoldFinch. Experience life as one of nature’s fiercest apex predators. Explore a beautiful habitat hunting for food, completing quests, and searching for your tiger soulmate.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/tiger-simulator-3d/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Tilo",
                "rating": "8.8",
                "released": "August 2020",
                "description": "Tilo is a physics-based platform game with 40 challenging levels. You have to collect shards to complete the levels.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/tilo/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "TimeWarriors",
                "rating": "8.9",
                "released": "December 2024",
                "description": "Time Warriors is a strategy game where you lead your army through history, from the Stone Age to futuristic battles. Upgrade your troops, build powerful bases, and use unique units and tactics to defeat your enemies. Master every era, outsmart your opponents, and rise to become the ultimate commander in this epic war game.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/timewarriors/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "TNTcraft",
                "rating": "8.6",
                "released": "November 2022",
                "description": "TNTcraft is a Bomberman-like game in a Minecraft world where your mission is to explode the zombie spawner using TNT. Make a team with an AI or play with your friend locally. Make tactics and explode zombies, but beware, some of the zombies can explode and may hurt you. There are four different maps available. Fight against zombies with your friend, make tactics, and blast your TNTs!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/tntcraft/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Tower Bastion: Zombie Defense",
                "rating": "8.8",
                "released": "May 2025",
                "description": "Tower Bastion: Zombie Defense is an intense horde-survival action game where you command a hero in a desperate stand against waves of the undead. Arm yourself with powerful firearms, deploy strategic defenses, and fight through chaos to protect your base from total collapse.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/tower-bastion-zombie-defense-ufh/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Tower vs Goblins",
                "rating": "9.3",
                "released": "February 2025",
                "description": "Tower vs Goblins is a thrilling tower defense game where you defend your base against relentless goblin invasions. Strategically build and upgrade your fortress with powerful weapons like ballistae and magic crystals. Explore a medieval world filled with epic battles, unique challenges, and dangerous foes as you outwit enemies and safeguard your stronghold!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/tower-vs-goblins/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "TowerWatch - PVP Battle",
                "rating": "9.0",
                "released": "June 2022",
                "description": "TowerWatch - PVP Battle is a tower defense game to fight the horde and other players using guns, traps, and magic. Battle and defend your tower in PVE & PVP Battles. Earn XP to upgrade your heroes & traps. Earn Battle Pass XP to win amazing skins, props, and rewards. Defend the Tower and defeat the evil forces!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/towerwatch---pvp-battle/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Trap Craft",
                "rating": "8.6",
                "released": "May 2022",
                "description": "Trap Craft is a defense game where there is a hacker who is ready to fulfill any desire of a Princess, Noob, Pro, Herobrine, and the rest if they want to play a game that the hacker prepared. The game is to protect the portal from the zombies' attack. Each character has its own ending, so find out all of them! Set traps and fight against the zombies, survive, and also get yourself a pet for your company.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/trap-craft/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Trojan War",
                "rating": "8.3",
                "released": "May 2022",
                "description": "Trojan War is a tower defense game where you find yourself in the midst of a war and must defend yourself against relentless enemies. Assemble your army and strategically position towers to counter the enemy's attacks. Upgrade your weapons and towers as you progress through each level to strengthen your defenses. Employ strategic thinking and skillful tactics to effectively attack your enemies and avoid defeat. Prepare yourself for the challenges ahead and strive for victory in this intense war!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/trojan-war/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Two Sides of Hell: Portable Edition",
                "rating": "8.9",
                "released": "February 2025",
                "description": "Two Sides of Hell: Portable Edition is a 2D action game where you must defend the Ally's base from relentless enemy hordes. Take on waves of foes, test your skills in challenging boss fights, and see if you can survive the chaos. Developed by the creators of Two Sides of Hell on Steam, this bite-sized version packs intense action into a portable experience. Will you rise to the challenge and protect the base?",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/two-sides-of-hell-portable-edition-unn/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Vampire Pixel Survivors",
                "rating": "8.6",
                "released": "November 2023",
                "description": "Vampire Pixel Survivors is the ultimate roguelike survival action game where you will find yourself surrounded by relentlessly undead waves. Collect experience and coins to level up your weapons and skills as you strive to be the last one standing in this unforgiving world. Explore diverse stages in desert landscapes, lush forests, and snowy realms. Craft powerful weapons, from flamethrowers to lasers, to annihilate undead hordes. Patience, skill, and upgrading your gear are your keys to survival. Are you up for the challenge of becoming the ultimate survivor?",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/vampire-pixel-survivors/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Viscous Ventures",
                "rating": "8.7",
                "released": "February 2024",
                "description": "Viscous Ventures is a 2D arcade platformer game where you must reach the finish by overcoming the monsters and obstacles along your way. Experience the epic journey across land, sea, and skies, utilizing diverse power-ups to conquer this 2D world!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/viscous-ventures/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Wacky Dungeon",
                "rating": "9.1",
                "released": "January 2021",
                "description": "Wacky Dungeon is a cartoonish action-packed RPG in which you can fight interactive battles against the weirdest of enemies.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/wacky-dungeon/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "War Groups",
                "rating": "8.6",
                "released": "February 2025",
                "description": "War Groups is a strategic war game set in the dangerous and mysterious Zone, where your goal is to capture all sectors and eliminate your enemies. Choose from over 10 unique factions, including stalkers, bandits, military forces, and sectarians, and build your army by collecting powerful artifacts.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/war-groups/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "War State IO: Conquer Battles",
                "rating": "8.0",
                "released": "April 2025",
                "description": "War State IO: Conquer Battles is a fast-paced strategy game where you lead your army, capture enemy camps, and expand your territory in real-time tactical warfare. Master the battlefield with quick thinking and smart maneuvers to claim victory.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/war-state-io---conquer-battles-znz/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Warrior Bee Apocalypse",
                "rating": "9.0",
                "released": "April 2025",
                "description": "Warrior Bee Apocalypse is a level-based horde survival game where you take on waves of enemy insects as a fearless warrior bee. Dodge, fight, and survive as the swarm closes in.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/warrior-bee-apocalypse/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Warrior Clash",
                "rating": "8.8",
                "released": "February 2025",
                "description": "Warrior Clash is a thrilling war strategy game where only the strongest prevail. Take command of fearless warriors, train elite units, and engage in high-stakes battles. Outsmart your opponents with clever tactics and assert your dominance on the battlefield. Every decision you make shapes your journey in this epic challenge of strength and strategy!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/warrior-clash-pzu/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "We Not Survive",
                "rating": "8.7",
                "released": "May 2023",
                "description": "We not survive is an idle tower defense game that challenges players to stay alive in a post-apocalyptic world overrun by zombies. As a survivor, you must defend your base from waves of terrifying monsters using a range of weapons and facilities that can be upgraded. The game's main currency is petroleum, which can be extracted and used to upgrade your base's weapons, projectiles, and health regeneration capabilities. As you progress through the game, you can unlock surprising unique powers and facilities that help you to defend yourself better against the increasingly challenging waves of enemies! So, are you ready to take on the zombie apocalypse and stay alive?",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/we-not-survive/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Weapons Ragdoll Arena",
                "rating": "9.1",
                "released": "May 2025",
                "description": "Weapons Ragdoll Arena is an action ragdoll game that throws you into an arcade battle where weapons fly in over-the-top ragdoll showdowns and every item packs unpredictable impact. Outsmart your rivals and survive the chaos as you climb your way to become the ultimate throwing champion!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/weapons-ragdoll-arena/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Wild Animal Zoo City Simulator",
                "rating": "8.9",
                "released": "May 2018",
                "description": "Wild Animal Zoo City Simulator is a classic rampage game from HGames who have developed other similar themed titles. The animals of the city zoo are tired of being held captive and it is your task to help them escape and cause mayhem on the city streets! You can choose from a range of different animals including a crocodile, an elephant, a hippo and a lion.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/wild-animal-zoo-city-simulator/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Wild Castle TD: Grow Empire",
                "rating": "8.9",
                "released": "September 2020",
                "description": "Wild Castle TD: Grow Empire is an excellent combination of tower and castle defense game! Build your defenses and use an excellent strategy to survive the monsters' onslaught.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/wild-castle-td-grow-empire/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Wizard.io",
                "rating": "9.2",
                "released": "March 2024",
                "description": "Wizard.io is an action game set in a realm of magic and mystery. Engage in intense duels amidst enchanting arenas teeming with mystical foes. Unleash elemental spells and cunning enchantments to overcome your adversaries. Explore dynamic spell combinations, collect magical orbs, and fortify your wizard's home base for strategic advantages. Unearth powerful artifacts to turn the tides in your favor.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/wizard-io/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Wolf Simulator: Wild Animals 3D",
                "rating": "9.0",
                "released": "February 2019",
                "description": "Wolf Simulator: Wild Animals is a fun and interesting animal simulation game in which you take control of a lone wolf. You must help the wolf survive against the harsh realities of the wild and try to find food and shelter. Move around this open world and hunt for prey - tackle other animals such as deer, bears and foxes - you must show your power and prove your strength as a hunter!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/wolf-simulator-wild-animals-3d/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "World Battle of the Future",
                "rating": "9.1",
                "released": "March 2023",
                "description": "World Battle of the Future is a battle strategy game in a post-apocalyptic world with memorable characters and a variety of weapons and skills. Try your best to survive the battle, develop your soldiers, strengthen weapons, and improve your armor and skills. Get resources to buy more military equipment and warriors. Gain experience in completing various missions. Upgrade your army by improving skills and weapons. Strengthen your military base. An epic battle for resources and domination of the world awaits you!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/world-battle-of-the-future/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "World Z Defense - Zombie Defense",
                "rating": "9.1",
                "released": "September 2024",
                "description": "World Z Defense - Zombie Defense is a thrilling action defense game where players must fight against hordes of zombies trying to overrun the world. In this post-apocalyptic scenario, your mission is to defend cities across the globe by strategically placing soldiers with different weapons, each offering unique stats like damage, shooting speed, and reload speed.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/world-z-defense---zombie-defense/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Zombie Coming: Roguelike Siege",
                "rating": "8.9",
                "released": "October 2023",
                "description": "Zombie Coming: Roguelike Siege is a roguelike game where you must defend against relentless zombie hordes using your skills, mines, barriers, and turrets. Strategically place mines and barriers to create a formidable defense line and use unique hero abilities like summoning an excavator to wreak havoc among the undead. Survive each day to earn rewards and face a variety of zombies, big and small, fast and slow, fiery and icy. Embrace your tactical prowess and build your defense in your style to conquer this chaotic onslaught.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/zombie-coming-roguelike-siege/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Zombie Survival",
                "rating": "8.8",
                "released": "December 2022",
                "description": "Zombie Survival is a survival game where you must protect your home from the zombie's attack at all costs! Shoot the zombies through your home windows and repair the broken ones to slow down the invaders. Unlock new rooms to enhance your defense area, and don't forget to upgrade your weapon to handle the increasing number of zombies at each wave. Avoid getting stuck in the corners, or the zombie will eat your brain!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/zombie-defense/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Zombie Drive Survivor",
                "rating": "9.1",
                "released": "January 2024",
                "description": "Zombie Drive Survivor is an action game where you get to drive a cool car and bravely face off against hordes of zombies! Bump into the zombies to crush them, but remember to watch out for your car's damage level because you don't want your car to be damaged and burnt down. Collect exp that the zombies drop every time you beat them. The exp will help you level up and become stronger. Unlock and pick awesome weapons to make defeating zombies even more fun! Many different types of zombies and enemy cars will try to stop you! But don't worry; you can earn coins to unlock new, more powerful cars and discover all sorts of cool weapons like machine guns, shotguns, rams, Molotov cocktails, rocket launchers, flamethrowers, harpoons, mines, traps, and more. There are two different game modes you can enjoy. Level game mode, where you can practice and have fun, and Endless Mode for you who want to challenge yourself to face wave after wave of zombies. The choice is yours!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/zombie-drive-survivor/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Zombie Horde: Build & Survive",
                "rating": "9.1",
                "released": "June 2025",
                "description": "Zombie Horde: Build & Survive is an intense action survival game where staying alive depends on a combination of strategy, well-timed decisions, and action. Build traps, guide your hero through relentless waves of the undead, and upgrade your gear regularly to keep up with the ever-growing number of zombies aimed at destroying you. Stay sharp and push your limits to see just how many zombies you can take on at once.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/zombie-horde-build-survive/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Z Hunter",
                "rating": "9.0",
                "released": "May 2024",
                "description": "Z Hunter is an action-packed shooter game where you defend your base from relentless zombie hordes. You're the commander, leading troops against waves of undead enemies. Save survivors to expand your base and unlock new resources. Upgrade your character, explore new areas, and discover a unique weapon at each location. Get ready for an epic battle for survival!",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/zombie-hunter-rro/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Zombie Space Episode 2",
                "rating": "8.9",
                "released": "May 2025",
                "description": "Zombie Space Episode 2 is a thrilling action-survival game set aboard a space station overrun by the infected. You’ll fight through waves of zombies, search for lost teammates, and uncover the origins of a deadly virus. Use powerful weapons, unlock hidden gear, and upgrade your heroes as you rely on their unique skills to survive the chaos.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/zombie-space-episode-2-ajp/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Zombie World Escape",
                "rating": "8.9",
                "released": "January 2025",
                "description": "Zombie World Escape is a thrilling survival adventure set in a post-apocalyptic world overrun by the undead. As the bunker’s guardian, you’ll battle relentless zombie hordes, rescue survivors, and gather essential supplies. Face challenging bosses and make critical choices to protect humanity’s last hope. Every moment is a test of your courage and strategy.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/zombie-world-escape-fqd/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Zombocalypse",
                "rating": "9.3",
                "released": "",
                "description": "Zombocalypse is an awesome zombie blasting game in which you fight waves and waves of undead.",
                "cover_image": "",
                "link": "https://games.crazygames.com/en_US/zombocalypse/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            }
        ]
    },
    {
        "name": "IO",
        "items": [
            {
                "title": "Cubes 2048.io",
                "rating": "7.8",
                "released": "December 2022",
                "description": "Cubes 2048.io is an addictive online game that fusesSnakeand2048. Get a bigger number by collecting free cubes and eating other players with a smaller number than you. Your cubes with the same value that bump into one another willmerge.",
                "cover_image": "https://imgs.crazygames.com/games/cubes-2048-io/cover_16x9-1693298929425.png?metadata=none&quality=100&width=1200&height=630&fit=crop",
                "link": "https://games.crazygames.com/en_US/cubes-2048-io/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Snake Clash.io",
                "rating": "8.3",
                "released": "February 2025",
                "description": "Snake Clash.io is an io snake game where you compete against players, outmaneuver rivals, and dominate the leaderboard. Grow longer, strategize, and prove your skill in fast-paced battles.",
                "cover_image": "https://imgs.crazygames.com/snake-clash-io_16x9/20250203091302/snake-clash-io_16x9-cover?metadata=none&quality=100&width=1200&height=630&fit=crop",
                "link": "https://games.crazygames.com/en_US/snake-clash-io/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Snake.io",
                "rating": "8.5",
                "released": "September 2022",
                "description": "Snake.io is an online io game where you control a snake, striving to survive in a battlefield of other snakes. Consume colorful food to grow larger and defeat rivals to become a formidable force",
                "cover_image": "https://imgs.crazygames.com/snake-io/20220928123850/snake-io-cover?metadata=none&quality=100&width=1200&height=630&fit=crop",
                "link": "https://games.crazygames.com/en_US/snake-io/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Snake Lite",
                "rating": "8.3",
                "released": "September 2023",
                "description": "Snake Lite is a casual arcade snake game with a competitive twist. Unlike other slither and snake games, you not only collect goodies and power-ups but also compete against other players to become the largest worm-like snake in the arena.",
                "cover_image": "https://imgs.crazygames.com/snake-lite-worm-snake-game_16x9/20231030060228/snake-lite-worm-snake-game_16x9-cover?metadata=none&quality=100&width=1200&height=630&fit=crop",
                "link": "https://games.crazygames.com/en_US/snake-lite-worm-snake-game/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            }
        ]
    },
    {
        "name": "Minecraft",
        "items": [
            {
                "title": "Agar.io",
                "rating": "8.4",
                "released": "June 2015",
                "description": "Agar.io is the original .io grow game. Play as a simple agar cell fighting to become the largest cell in a multiplayer game arena. Avoid the bigger cells and consume the smaller ones to grow larger.",
                "cover_image": "https://imgs.crazygames.com/agario/20230719092731/agario-cover?metadata=none&quality=100&width=1200&height=630&fit=crop",
                "link": "https://games.crazygames.com/en_US/agario/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Agents.io",
                "rating": "8.6",
                "released": "June 2023",
                "description": "Agents.io is a thrilling multiplayer game where you engage in action-packed battles with rival gangs. As a player, you take control of your own gang and navigate through dynamic battlegrounds, aiming to eliminate rival agents and secure victory for your team. Quick reflexes, strategic shooting, and effective communication with your teammates are essential to succeed in this intense showdown.",
                "cover_image": "https://imgs.crazygames.com/agents-io/20230609044850/agents-io-cover?metadata=none&quality=100&width=1200&height=630&fit=crop",
                "link": "https://games.crazygames.com/en_US/agents-io/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Archer Clash",
                "rating": "9.1",
                "released": "June 2025",
                "description": "Archer Clash is a fast-paced io game where you guide a lone hero racing across a rolling, hill-like battle arena. You’ll recruit allies, adapt your tactics, and face shifting challenges as you fight for control. Every decision shapes your path to victory, blending quick reflexes with smart strategy in a thrilling clash of skill and growth.",
                "cover_image": "https://imgs.crazygames.com/archer-clash-ftj_16x9/20250613030347/archer-clash-ftj_16x9-cover?metadata=none&quality=100&width=1200&height=630&fit=crop",
                "link": "https://games.crazygames.com/en_US/archer-clash-ftj/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Archers Battle",
                "rating": "8.5",
                "released": "April 2025",
                "description": "Archers Battle is an .io-style third-person shooter game, packed with stickmen, horses, bows, and arrows! Battle against players from around the world, collect diamonds, and rise to the top of the leaderboard! Jump into the Archers Battle arena, unleash your inner marksman, and prove your skill in this chaotic stickman showdown!",
                "cover_image": "https://imgs.crazygames.com/archers-battle_16x9/20250416101236/archers-battle_16x9-cover?metadata=none&quality=100&width=1200&height=630&fit=crop",
                "link": "https://games.crazygames.com/en_US/archers-battle/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Arx Arcana (Last Mage Standing)",
                "rating": "9.2",
                "released": "March 2019",
                "description": "Arx Arcana: Dungeon Royale is a cool battle royale game with a fantasy twist. The 2D graphics and top-down gameplay are superb. In this multiplayer game, you must fight against hundreds of players from around the world.",
                "cover_image": "https://imgs.crazygames.com/arx-arcana-dungeon-royale/20201106152604/arx-arcana-dungeon-royale-cover?metadata=none&quality=100&width=1200&height=630&fit=crop",
                "link": "https://games.crazygames.com/en_US/arx-arcana-dungeon-royale/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "BattleDudes.io",
                "rating": "8.7",
                "released": "May 2021",
                "description": "BattleDudes.io is an action-packed 2D multiplayer IO battle game where chaos reigns supreme. Engage in fierce battles against other players, unleashing a powerful arsenal of guns, tanks, and explosive weaponry to dominate the battlefield. With multiple maps and diverse game modes, every match offers a new challenge and a chance to show off your strategic prowess. Log in, level up, and unlock powerful upgrades that will make you an unstoppable force!",
                "cover_image": "https://imgs.crazygames.com/battledudes-io_16x9/20241216121046/battledudes-io_16x9-cover?metadata=none&quality=100&width=1200&height=630&fit=crop",
                "link": "https://games.crazygames.com/en_US/battledudes-io/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Big Battle Mini",
                "rating": "8.7",
                "released": "July 2025",
                "description": "Big Battle Mini is an action-packed online multiplayer game where you face off against friends and rivals in fast, thrilling mini battles. Test your reflexes, outsmart opponents, and claim victory in quick-fire matches that keep the competition fierce and the fun nonstop.",
                "cover_image": "https://imgs.crazygames.com/big-battle-mini_16x9/20250715033353/big-battle-mini_16x9-cover?metadata=none&quality=100&width=1200&height=630&fit=crop",
                "link": "https://games.crazygames.com/en_US/big-battle-mini/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "BlockTanks.io",
                "rating": "8.3",
                "released": "October 2020",
                "description": "BlockTanks is an online tank battle .io game. Choose your preferred game mode and shoot to destroy enemy tanks and increase your score. You can play solo or in teams. Find upgrades to gain an advantage and dominate the leaderboard!",
                "cover_image": "https://imgs.crazygames.com/blocktanks-io_16x9/20240108063944/blocktanks-io_16x9-cover?metadata=none&quality=100&width=1200&height=630&fit=crop",
                "link": "https://games.crazygames.com/en_US/blocktanks-io/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            }
        ]
    },
    {
        "name": "Thinky",
        "items": [
            {
                "title": "Bloxd.io",
                "rating": "8.3",
                "released": "March 2021",
                "description": "Bloxd.io is an IO adventure game with Minecraft-style visuals and multiple game modes, including parkour challenges, creative sandbox building, and combat-based gameplay.",
                "cover_image": "https://imgs.crazygames.com/bloxdhop-io_16x9/20250829023851/bloxdhop-io_16x9-cover?metadata=none&quality=100&width=1200&height=630&fit=crop",
                "link": "https://games.crazygames.com/en_US/bloxdhop-io/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Braains.io",
                "rating": "8.6",
                "released": "April 2018",
                "description": "Which side will you choose in Braains.io? Braains.io is an awesome multiplayer game of survival – you start as a human but you can transform into a zombie immediately if you wish and try to turn the other players into a zombie too.",
                "cover_image": "https://imgs.crazygames.com/braains-io/20230217181314/braains-io-cover?metadata=none&quality=100&width=1200&height=630&fit=crop",
                "link": "https://games.crazygames.com/en_US/braains-io/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "BrutalMania.io (Brutal Mania)",
                "rating": "8.5",
                "released": "October 2018",
                "description": "BrutalMania.io (Brutal Mania) is an online gladiator IO action game where you are armed with savage weapons with one simple mission to take down every rival gladiator in sight. The battles are brutal, the carnage is real, and only the strongest will survive. Smash, slice, and crush your way to becoming the last warrior standing in this gruesome fight for supremacy. With each victory, you grow stronger, unlocking powerful upgrades and devastating new weapons to dominate the arena.",
                "cover_image": "https://imgs.crazygames.com/games/brutalmania-io/cover-1584553430060.png?metadata=none&quality=100&width=1200&height=630&fit=crop",
                "link": "https://games.crazygames.com/en_US/brutalmania-io/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Build Royale",
                "rating": "8.7",
                "released": "October 2018",
                "description": "Build Royale is a battle royale game where you build defenses and battle other players in a 2D top-down world. Explore the map and find various weapons and resources to help you take down your enemies.",
                "cover_image": "https://imgs.crazygames.com/buildroyale-io/20230424161238/buildroyale-io-cover?metadata=none&quality=100&width=1200&height=630&fit=crop",
                "link": "https://games.crazygames.com/en_US/buildroyale-io/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Bump.io",
                "rating": "8.6",
                "released": "October 2019",
                "description": "There are 16 cars are involved in the competition. You must avoid collisions with the boundaries to win. Bumping other cars give energy, and destroying other cars to give volume growth.",
                "cover_image": "https://imgs.crazygames.com/games/bump-io/thumb-1570533394420.png?metadata=none&quality=100&width=1200&height=630&fit=crop",
                "link": "https://games.crazygames.com/en_US/bump-io/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Car Clash 2",
                "rating": "8.7",
                "released": "May 2024",
                "description": "Car Clash 2 is an intense io game where cars battle in a challenging desert arena. Choose a powerful vehicle with high health, armor, and speed to stay alive. Collect map features to boost your attack range, speed, and power. Earn Cash and GEMs by surviving and destroying enemies, and use them to acquire even the most expensive cars. Let the battle begin!",
                "cover_image": "https://imgs.crazygames.com/car-clash-2_16x9/20240524043337/car-clash-2_16x9-cover?metadata=none&quality=100&width=1200&height=630&fit=crop",
                "link": "https://games.crazygames.com/en_US/car-clash-2/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Castles.cc (Cubic Castles)",
                "rating": "8.5",
                "released": "September 2020",
                "description": "Castles.CC (Cubic Castles) is an open world MMO game where you can build, trade, mine, craft, and roleplay! Create your dream world, fight battles, and explore with other players in the active community.",
                "cover_image": "https://imgs.crazygames.com/castles-cc/20210310112233/castles-cc-cover?metadata=none&quality=100&width=1200&height=630&fit=crop",
                "link": "https://games.crazygames.com/en_US/castles-cc/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            },
            {
                "title": "Chompers.io",
                "rating": "8.7",
                "released": "September 2019",
                "description": "Chompers.io is an evolution-based battle game in the .io games genre. In the game, you control a monster that can evolve as you eat food and eliminate other players. Try to become the strongest player around in the arena!",
                "cover_image": "https://imgs.crazygames.com/games/chompers-io/cover-1584553166691.png?metadata=none&quality=100&width=1200&height=630&fit=crop",
                "link": "https://games.crazygames.com/en_US/chompers-io/index.html?isNewUser=true&skipPrerollFirstSession=true&v=1.339"
            }
        ]
    }
]