{
    "title": "Onet Connect Classic",
    "description": "In Onet Connect, your objective is to connect tiles by matching pairs. You get to choose what type of board you want to play on. Choose from cute animals, tasty candies, or juicy fruits, and keep matching until the board is fully cleared. Inspired byclassic mahjong, Onet Connect takes a fresh approach to pairing games. Each mode comes with the same rules but provides a different visual twist, so you can switch up the theme while honing your skills.\nYou can match tiles that are side by side, and initially, you will have to do to begin making a bit of board space. Once you have some of the board clear, you can match any tiles that may not be side by side but instead have blank space between the two.\nQuick thinking is essential, especially because there is a ticking clock breathing down your neck—but don’t worry—there’s a hint option to lend a hand if you get stuck!\nIf you’re new to Onet Connect or need a refresher on how the pieces link, simply hit pause and click the question mark icon. This feature provides a clear visual guide to help you understand the connection mechanics, ensuring you can tackle even the trickiest boards with confidence.\nWinning a round grants you extra points to boost your score, as well as additional shuffles. These shuffles let you rearrange the board when you’re struggling to find matches, opening up new possibilities. Plus, you have access to three hints, each one showing two connectable pieces to help you out of tough spots. Use them wisely—they’re free but limited!\nThe levels in Onet Connect gradually increase in difficulty, testing both your speed and your strategy. As you progress, you’ll be challenged to match faster, spot connections more efficiently, and use your shuffles and hints more strategically. It’s the ultimate test of your concentration and quick reflexes, inviting you to keep improving and setting high scores. Dive in and see if you can master every mode, conquer the timer, and reach the highest levels in this addictive matching adventure!",
    "cover_image": "https://imgs.crazygames.com/games/onet-connect-classic/cover_16x9-1709113771726.png?metadata=none&quality=100&width=1200&height=630&fit=crop",
    "link": "https://www.crazygames.com/embed/onet-connect-classic"
}