{
    "title": "Open House",
    "description": "You, Oscar, are fresh off a rough flight, and things couldn’t have started worse. Somewhere during the trip, all your belongings fell out of the plane. You beg Theo, the pilot who took you to this island, to turn back so you can find them, but he refuses, saying he has too many passengers. He takes off without you.\nTrying to stay positive, you decide this might be the perfect chance to start over in your new beachside home. After all, it’s only a suitcase… and luckily, you were wearing your favorite shirt during the flight. Time to see your new place.\nYou greet your neighbor, who’s not exactly welcoming, then head toward your new home only to find it looks nothing like the pictures from the real estate listing. The porch is falling apart, the rooms are wrecked, and it’s clear today is not your day. You can’t help but wonder if you’re on some sort of prank show.\nYour first quest is to remove all the covers from the furniture in hopes of finding a hidden camera. To do this, you’ll complete match-3 puzzles that appear on the screen. Each match earns points and helps you move forward.\nAs you work, you notice the place is so bad that it even has critters running around. It’s time to contact the real estate agency. You sit at your computer only for the desk to collapse. You’ll need to replace both the desk and the chair before you can write to Mr. Fraudley, the man who sold you this disaster of a house. You send him a message explaining the mess… and get blocked immediately.\nJust when you’re feeling hopeless, your neighbor Charles surprises you by finding your missing suitcases, but the purple flower, which means a lot to you, is still missing. He advises you to get a wardrobe to store your clothes. After that, you’ll need a good night’s rest, which means buying a new bed.\nBetween each home repair or furniture purchase, you’ll play match-3 puzzles to earn what you need. Every successful round brings you closer to fixing up the house.\nYou keep trying to leave the island, but something always stops you. In the meantime, you keep decorating, cleaning, and repairing. Over time, you might just discover that this wrecked beach house has the potential to become the dream home you never knew you wanted.",
    "cover_image": "https://imgs.crazygames.com/open-house_16x9/20250703074341/open-house_16x9-cover?metadata=none&quality=100&width=1200&height=630&fit=crop",
    "link": "https://www.crazygames.com/embed/open-house"
}