{
    "title": "Words of Wonders",
    "description": "Words of Wonders is an engaging word puzzle game that combines the excitement of crossword puzzles with the thrill of word search. Players form words by connecting letters in a grid, unlocking hidden words,, and progressing through levels.\nYou'll see a grid of random letters when you start the game. Each grid represents a level; your task is to find words by connecting adjacent letters. You can swipe your finger over the letters in any direction (horizontally, vertically, or diagonally) to form words. Longer words and more complex combinations may unlock bonus rewards, so watch for opportunities to maximize your word choices.\nConnect the letters to form a word. It will be revealed if the word you formed is on the crossword grid. Not all words will be on the grid, so use the letters you have already discovered to ensure you create words that will fit the puzzle!\nCompleting the grid allows you to unlock the next level, which gets progressively more challenging. The difficulty increases with more letters and words to find, so keep your brain engaged as you move through the game.\nSome examples include finding the words “WON,” “OWN,” “NOW,” or “TOP,” “POT,” or “OPT” from a set of three letters. Or a mixture of three and four-letter words to form “WALL,” \"ALL,” and “LAW.”\nIf you find yourself stuck, there are hints and boosters available to help you out. These tools can reveal letters or help you find the next word, though they're limited, so use them wisely. There are also rewards for completing levels or discovering difficult words, such as coins or additional hints, which can help you advance further.\nProgress through the levels and collect unique background images with each new milestone. The levels get more difficult by introducing longer words and more letters, increasing the chances of getting it wrong and challenging your vocabulary skills!\nSome levels feature specific themes, like landmarks or animals, where the words you form are related to that theme. As you progress, you’ll unlock different \"worlds\" or locations, each with unique challenges and puzzles. You also get fun bits of info throughout, like learning that The Great Pyramid of Giza is the oldest of the Seven Wonders of the Ancient World.\nThe goal is to find all the words in the grid before you run out of moves or time. Each level has a set number of words to complete in order to progress to the next stage. You may also encounter bonus rounds or challenges that offer extra rewards when completed.\nAs you move through levels, you'll earn points, coins, and other rewards, which will help you advance in the game. Some versions of the game also let you compete against friends or other players, adding a competitive element to the experience.\nWith its relaxing pace and engaging gameplay, Words of Wonders is a fun way to challenge your mind and expand your vocabulary while enjoying an immersive puzzle-solving experience.\nEnjoy a range of exciting and challenging word puzzles in Words of Wonders. The game features an easy starting point to suit players of all ages and experience levels. See how good you are at finding all the words and become a master wordsmith!\nGame Tips",
    "cover_image": "https://imgs.crazygames.com/words-of-wonders_16x9/20231019163757/words-of-wonders_16x9-cover?metadata=none&quality=100&width=1200&height=630&fit=crop",
    "link": "https://www.crazygames.com/embed/words-of-wonders"
}