{
    "title": "AOD - Art Of Defense",
    "description": "Your mission in AOD Art of Defense begins with an urgent message from Mr. Ivil—find the blueprints of the fabled Inola Project at all costs—even if it means reducing the city to rubble. Time is of the essence. Meanwhile, Ich Nevel warns of an imminent large-scale assault on your bases. The stakes couldn’t be higher, and it’s up to you to defend humanity’s last hope. You have one goal - to protect your base at all costs.\nDynamic battles ensure that every moment is filled with action. Combining elements of Tower Defense, RPG, and tactical strategy, the game features over 500 sectors for real-time warfare, offering a variety of environments—from small villages to massive abandoned megapolises. You’ll face challenges in exciting new Tower Defense modes like escape, fog, and survival.\nThe aim is strategically deploying siege houses, tanks, and armed trucks to stop enemy forces before they breach your defenses. With over 1,000 tower upgrades, including tanks, miniguns, and air defense systems, your arsenal is as vast as powerful. Along the way, you’ll unlock six unique heroes, each with their own abilities to level up and master. From nuclear bombs to ionic satellite strikes and ballistic barrages, a range of devastating boosters will turn the tide in your favor.\nEvery successful defense wave rewards you with crystals, essential for upgrading your arsenal. The longer you survive, the greater the rewards, but enemies will become stronger with each attack. Hundreds of card upgrades allow you to customize your towers for maximum efficiency, keeping your strategies fresh and adaptable.\nSet in a near-future world devastated by nuclear wars, 70% of the population has been wiped out. The survivors face constant terror from Mr. Ivil, who has united gangs into a brutal army bent on finding the Inola Project blueprints. His forces leave no settlement untouched, robbing and killing indiscriminately. Your task is to stop them and save what remains of the planet.\nIn this endless survival mode, your tactics and preparation are key. Build your defenses wisely, place your siege houses strategically, and upgrade your resources to keep pace with the escalating challenge. Each location demands new strategies and better equipment, pushing your tactical skills to the limit.\nWhether you’re battling through small villages or abandoned megapolises, the world's fate depends on you. With the power of innovative weapons, unique heroes, and an array of upgrades, you hold the key to humanity’s survival. Will you rise to the challenge?",
    "cover_image": "https://imgs.crazygames.com/aod---art-of-defense_16x9/20250317100902/aod---art-of-defense_16x9-cover?metadata=none&quality=100&width=1200&height=630&fit=crop",
    "link": "https://www.crazygames.com/embed/aod---art-of-defense"
}