{
    "title": "Stabfish 2",
    "description": "Your goal in Stabfish 2 is to kill or be killed, with each attack on your prey giving you another layer of strength and skill, along with an unlock of new and more spacious waters.\nBegin your underwater journey by choosing from a powerful lineup of shark evolutions. Each time you’re defeated in the arena, you’ll evolve, progressing from a Blue Shark to a mighty Great White and, ultimately, to the fearsome Megalodon. Each evolution is packed with upgrade potential, and as you advance, your shark gains new abilities that make it even deadlier in the water. Unlocking these upgrades is vital and requires milestone achievements, giving you a true sense of accomplishment as your shark’s power grows.\nStabfish 2 brings fierce, fast-paced action to the underwater battlefield. You’ll need razor-sharp reflexes and tactical smarts to avoid being impaled in seconds by rival sharks. Use your boost to dart across the arena, aiming to catch bigger foes off guard with your swift movements. When you successfully impale an enemy, they’ll be stuck to your tusk until you drive them into a wall, releasing food from their remains to replenish your strength and prepare for the next hunt.\nEnhance your shark with Stabfish 2's unique looting and crafting system. Every encounter offers valuable resources to add to your inventory, including materials, blueprints, and decorative items. Use your materials to bring blueprints to life, crafting new equipment with varying rarity and power. Collecting and crafting gear not only boosts your survival odds but also lets you customize your shark’s style and abilities.\nJoin forces with other players to form a powerful shark team and compete in the epic 'Armageddon' event that takes place every hour. Team up, strategize, and aim for the top of the event leaderboard to claim victory in the fierce, all-out battles. Whether you create your own team or join an existing one, diving into cooperative gameplay adds a thrilling layer to your Stabfish 2 experience.",
    "cover_image": "https://imgs.crazygames.com/stabfish2-io-multiplayer_16x9/20250108041122/stabfish2-io-multiplayer_16x9-cover?metadata=none&quality=100&width=1200&height=630&fit=crop",
    "link": "https://www.crazygames.com/embed/stabfish2-io-multiplayer"
}