{
    "title": "Fragen",
    "description": "In Fragen, you take on the role of a soldier in full combat gear, ready to fight your way through an abandoned complex filled with enemies. As you roam, you’ll face shooters everywhere, so stay alert. Switch between close-range and long-range guns depending on your position, and always keep an eye both ahead and over your shoulder.\nStart by choosing either a solo or team battle, then pick your mode. Solo battle options include free-for-all, sniper only, or secondary weapon only. Team battle offers modes like team deathmatch, gun race, sniper only, and secondary only.\nThe game features a battle pass where you can earn skins, gear upgrades, and exclusive rewards. Weapon customization lets you fine-tune rifles, shotguns, snipers, and more to fit your style.\nFor best results, use a controller or mouse, as playing solely with the keyboard can slow you down. Speed and precision are key to survival.\nYour arsenal consists of primary and secondary weapons. Check their stats carefully for headshot damage, range, fire rate, and capacity to find what best fits your play style and the current environment. Weapons can only be purchased once you’ve earned enough reward points.\nSolo battle modes include:\nTeam battle modes include:\nRewards vary daily and can include cash, armor, weapons, and more. Since there are no maps to guide you, rely on your instincts to navigate the terrain.\nUse the tactical cover system to take advantage of terrain and obstacles, gaining the upper hand in firefights. Prove yourself in ranked modes and clan challenges by climbing leaderboards and competing as a team.\nFight through stunning environments—from neon-lit streets to desert bases and industrial zones. With smooth controls, intuitive aiming, and immersive graphics and sound, Fragen delivers realistic and intense battles for both newcomers and veterans alike.\nGet ready for nonstop action where every battle counts, whether you’re going solo, teaming up, or climbing the ranks. With deep customization, tactical gameplay, and stunning environments, this shooter delivers fast, immersive combat that keeps you coming back for more.",
    "cover_image": "https://imgs.crazygames.com/fragen_16x9/20250620035208/fragen_16x9-cover?metadata=none&quality=100&width=1200&height=630&fit=crop",
    "link": "https://www.crazygames.com/embed/fragen"
}